[
    {
        "Title": "Euro Cup 2016 kicks off today!",
        "Desc": "PARIS, June 10: The second big continental soccer championship of the summer has certainly heated up the world. Hosts France are set to face Group A opponents Romania at the Stade de France amid an unprecedented security operation, weather and strike fears.France remains as the state of emergency due to last November's attacks on Paris, when 130 people were killed.More than 90,000 police, soldiers and private guards will be deployed to ensure security throughout the tournament, with seven million fans expected to visit the 10 host venues. The game is set to kick off at 12:45 AM, NST. It is to be broadcast by Sony ESPN network in Nepal and India."
    },
    {
        "Title": "Ali to return to his old Kentucky neighborhood 1 last time",
        "Desc": "LOUISVILLE, Ky., June 10: Muhammad Ali will return to his old Kentucky neighborhood one last time.\rAli's body will ride in a miles-long procession spanning his life — from his boyhood home where he shadowboxed and dreamed of greatness to the boulevard that bears his name and the museum that stands as a lasting tribute to his boxing triumphs and his humanitarian causes outside the ring. Louisville is accustomed to being in the limelight each May when the Kentucky Derby at Churchill Downs captures the world's attention. But the send-off for the three-time heavyweight champion and global advocate for social justice looms as one of the city's most historic events.\r\"We've all been dreading the passing of The Champ, but at the same time we knew ultimately it would come,\" Louisville Mayor Greg Fischer said. \"It was selfish for us to think that we could hold on to him forever. Our job now, as a city, is to send him off with the class and dignity and respect that he deserves.\"\rAli died last Friday at 74 after a long battle with Parkinson's disease. The procession and memorial service follow a traditional Muslim funeral service held Thursday afternoon. The faithful traveled from all over the world to pay their respects.\rThousands more are expected to line the procession route Friday to wave a final goodbye to the city's favorite son. The motorcade will begin at the funeral home and head north onto the interstate. It will pause briefly as it overlooks the Muhammad Ali Center in the heart of downtown.\rThe cars will head west onto Muhammad Ali Boulevard, pass the Kentucky Center for African-American Heritage and visit his childhood home on Grand Avenue. Then it will turn toward his final resting place. Officials predict a 90-minute tour.\rThe procession ends at Cave Hill Cemetery where his family and closest friends will gather for a private burial.\rAt 2 p.m., thousands will gather at the KFC Yum Center a final send-off befitting The Greatest.\rThe service will feature a eulogy by former President Bill Clinton, a longtime friend, and remarks by comedian Billy Crystal, television journalist Bryant Gumbel and the champ's wife, Lonnie. The king of Jordan and president of Turkey will attend.\rPresident Barack Obama was unable to make the trip because his daughter, Malia, is graduating from high school. Valerie Jarrett, a senior White House adviser, will read a letter Obama wrote to Ali's family at the service.\rThe memorial is expected to draw 15,000 people and will bookend a weeklong series of planned services and spontaneous celebrations.\rThe Ali Center stopped charging people for admission. A tour company began impromptu tours of Ali's path through the city. Businesses printed his quotes across their billboards. City buses flashed \"Ali - The Greatest\" in orange lights across their marquees. A downtown bridge said it would be lit the rest of the week in red and gold: red for his gloves and gold for his medal.\rHow can the storied life of a man revered by fans worldwide be encapsulated in a two-hour service? As it turns out, Ali called the shots.\rYears ago, the champ signed off on how he wished to say goodbye to the world. One of his mandates was that ordinary fans attend, not just VIPs. Thousands of free tickets were snatched up within an hour, many fans waiting hours for the chance to witness history.\r\"Everybody feels a sense of loss with Ali's passing,\" said Mustafa Abdush-Shakur, who traveled from Connecticut to pay tribute to him. \"But there's no need to be sad for him. We're all going to make that trip.\""
    },
    {
        "Title": "Suarez officially ruled out as Uruguay faces talented Mexico",
        "Desc": "GLENDALE, Ariz, June 5: Mexico might have its best team ever to compete in the Copa America, and its opening game will be against a Uruguay team without its best player.\rAt a news conference Saturday evening, Urugauy coach Oscar Tabarez officially ruled out Luis Suarez for Sunday night's match.\r \"He is a footballer that always surprises us with his recovery,\" Tabarez said, \"but he is not ready yet.\"\rSuarez injured a hamstring two weeks ago.\rTabarez's comment came about an hour after Mexico coach Juan Carlos Osorio said he wouldn't be surprised if Suarez plays, calling him \"one of the top five forwards of the world.\"\rNow Uruguay — a 15-time champion in a competition known as the South American championship for most of its existence — will be a clear underdog against a deep, talented Mexico team that is on a 19-game unbeaten streak and hasn't been scored upon in the last 730 minutes.\rOsorio talked of a goal of finishing in the top three in the Copa America competition, and could do better than that. Mexico joins Argentina and possibly Brazil as favorites for the \"Centanario\" edition of Copa America, commemorating the 100 years since the competition began.\rMexico has made it to the Copa America finals twice but never has won.\r\"Right now we believe we are a good enough team to make it possible,\" midfielder Andres Guadardo said.\rIt could be the toughest match in Group 3 for either team, and Mexico is at home away from home in its U.S. matches. It had big, supportive crowds in friendlies in Atlanta and San Diego and could get a bigger, more boisterous pro-Mexico gathering at University of Phoenix Stadium Sunday night.\r\"We have a lot of fans here and we feel it,\" defender Jorge Torres Nilo said. \"But when you have the crowd and things like that, it's not the difference in what happens on the field. Basically there's just going to be way more people supporting us and that's it.\"\rTorres Nilo said the players \"try not to think about the winning streak much. A streak is a game-by-game thing.\"\r\"To win we have to beat a high-caliber team with big-time players,\" he said. \"It's not going to be an easy match.\"\rOsorio has kept opponents guessing with a variety of lineups.\rTabarez said he has a suspicion of what Mexico will do but doesn't know for certain.\rUruguay defender Jose Mariz Giminez said he is fine with his team being the underdog.\r\"We don't want to be the favorite for a moment,\" he said. \"We'll do the same work we always do. We try to ignore all the other stuff.\"\rDespite speculation to the contrary, Uruguay players had always said they expected to be without Suarez and were preparing with that in \rmine.\r\"We knew we weren't going to have him from the start,\" midfielder Egidio Arevalo Rios said. \"We'll do the best we can without him. When teams know they won't have to face Luis Suarez they might feel OK, but we have others who can step in.\"\rUruguay defender Jose Mariz Giminez said he is fine with his team being the underdog.\r\"We don't want to be the favorite for a moment,\" he said. \"We'll do the same work we always do. We try to ignore all the other stuff."
    },
    {
        "Title": "IPL: KKR clinch thriller, hand Pune fourth straight defeat",
        "Desc": "PUNE, April 25: In a game of fluctuating fortunes, Supergiants posted a decent looking 160 for five after being put in to bat. KKR maintained a high net run-rate right from the start and, although they lost wickets regularly, were able to cross the finishing line with three balls to spare. Umesh Yadav turned out to be the man of the moment as he smacked Thisara Perera in the long on stands, with his team needing five runs off four balls, with just two wickets in hand.In a game dominated by two Mumbaikars from the either side, Suryakumar Yadav played a defining knock of 60 (43 balls, seven fours, two sixes), while Ajinkya Rahane’s 52-ball 67 for the Supergiants went in vain.\rYadav was in superb touch, despite losing the team's highly successful opening duo of Gautam Gambhir and Robin Uthappa inside the first three overs. Yadav, batting at No 3, kept attacking, and helped his team to 59 for 2 by the end of the Powerplay.Dhoni introduced Rajat Bhatia right after the Powerplay, and the experienced cricketer pulled things back for the hosts. Just 22 runs came from the next five overs, with Bhatia bowling three of them, and getting the wicket of Shakib Al Hasan.The likes of Yusuf Pathan (36 off 27 balls), Andre Russel (17 off 11 balls) R Sathish (10 from 8 balls) all made useful contributions to make KKR the favourites in the chase.\rFor Supergiants, it was their fourth successive loss, and puts them under more pressure now, going into their next game against Sunrisers Hyderabad in Hyderabad.Earlier, Ajinkya Rahane’s 67-run knock was the backbone of the Supergiants innings. Rahane played a very similar knock to the one against RCB a couple of nights ago, when he scored 60 off 46 balls in an unsuccessful chase. Rahane hit boundaries with relative ease, while some of the other Supergiants batsmen struggled, especially during the first 15 overs. The Powerplay overs yielded the hosts just 31 runs, which was a bit of a setback.Rahane and Steve Smith added 66 runs for the second wicket off 50 balls to set the platform for the big hitters. And the big hitters didn’t disappoint, with Thisara Perera (12 runs from 9 balls), Albie Morkel (16 runs off nine balls) and skipper Dhoni (23 not out from 12 balls) all making a contributions.Supergiants added 60 runs off the last five overs. Dhoni plundered Morne Morkel for 17 runs in the final over off the innings, including two fours and a six. It looked a par score, but wasn’t quite enough in the end."
    },
    {
        "Title": "Leicester's Vardy backed by Hodgson as he faces extended ban",
        "Desc": "LONDON, APril 21:England coach Roy Hodgson backed Jamie Vardy on Wednesday, saying the Leicester striker did not dive in the incident that led to him being sent off last weekend and sympathizing with his angry response to the referee.Hodgson's employer, the English Football Association, charged Vardy with improper conduct over his reaction to the red card in Sunday's 2-2 draw with West Ham.\rVardy is set to have his standard one-match ban extended by the FA if he is found guilty. That could damage Leicester's bid for the title, with the team five points clear of Tottenham with four games remaining.Vardy, though, could now use Hodgson as a character witness. Leicester's top scorer tangled with Angelo Ogbonna before going down in the penalty area early in the second half.\"I don't see that as a dive,\" Hodgson said. \"I think he was unbalanced. I don't think it was a penalty either, I think he was unbalanced, running at that speed.\"I think there was a very slight sort of contact with the defender, who was trying to cover.\"Vardy confronted referee Jon Moss, jabbing a finger at the match official while appearing to express his anger at receiving his first red card of the season.\"I sympathize with him, I think he was very, very unlucky,\" Hodgson said. \"But now he has had to swallow the fact that he has been made to leave the field and then, unfortunately, he has reacted like sometimes human beings react.\"He hasn't just said to the ref, 'Thanks very much, I understand' and shakes hands and 'Have a good game'. He has called him a few names, but he is a human being and that can happen.\"Vardy seems certain to be in Hodgson's plans for the European Championship in June and July after leading Leicester's stunning pursuit of a first-ever top flight title, scoring his 22nd goal of the season before being dismissed on Sunday."
    },
    {
        "Title": "Leicester winger Mahrez voted England's player of the year",
        "Desc": "LONDON, APril 25: Leicester winger Riyad Mahrez became the first African to be named English football's player of the year on Sunday, straight after the Algerian helped his team close in on the Premier League title.Mahrez was flown by helicopter to the Professional Footballers' Association ceremony in London after scoring his 17th goal of Leicester's astonishing title charge as the leaders beat Swansea 4-0 at the King Power Stadium in central England.\rMahrez was on a six-man shortlist including Leicester teammates Jamie Vardy and N'Golo Kante for the vote of their fellow professionals in English football.\"I'm very grateful to receive this award,\" Mahrez said. \"It's extra special because if the players vote for me, it's because they've seen I've been great this year, so I'm happy. But it's more team things. Without my teammates I wouldn't get this award.\"The 25-year-old Mahrez is only the second winner of the PFA award from outside England. Uruguay striker Luis Suarez won it in 2014 while playing for Liverpool.Unlike Suarez, Mahrez was an unknown when he moved to England two years ago, joining Leicester from second tier French side Le Havre for less than 500,000 pounds (then about $820,000).The transfer now seems one of the best bargains ever in English football, where the record fee is the 59.7 million pounds (then $99 million) that United paid for Angel Di Maria in 2014 before selling the winger the following year.Mahrez has provided inventiveness and flair to Leicester's attacking play, contributing not only goals but also 11 assists to help transform a team that fought for Premier League survival last season. Now a guaranteed starter, Mahrez was an unused substitute this weekend a year ago when Leicester beat Burnley to finally escape the relegation zone.Leicester started the season as a 5,000-1 title outsider but is now set to become English football's first maiden championship winner since Nottingham Forest in 1978.\"The secret has been team spirit,\" Mahrez said. \"We work so hard for each other. We are like brothers, it's everywhere on the pitch. That's our strength.\"If sometimes we are not good, we know we are going to run and make the effort for our teammates.\"The team, which is owned by Thai duty free retail giant King Power, will be guaranteed the Premier League trophy by winning two of its remaining three games.Only Tottenham can now deny Leicester the title. The second-place London team is eight points behind ahead of Monday's game against West Bromwich Albion after also mounting a surprise title bid.A Tottenham player picked up the PFA ceremony's second-biggest accolade after 20-year-old midfielder Dele Alli was voted young player of the year.Alli, who was playing in the third tier last season with MK Dons, has made an instant impact in the Premier League, scoring 10 goals and providing 12 assists. He was unable to attend the ceremony because he was preparing with his teammates to face West Brom. Ryan Giggs became the latest illustrious Manchester United great to be handed the PFA award for \"meritorious service to football,\" following in the footsteps of former managers Alex Ferguson and Matt Busby, and European Cup winner Bobby Charlton.The former winger, who was voted PFA player of the year in 2009, is now assistant manager to Louis van Gaal at Old Trafford.Giggs made a club record 963 appearances for United and remains the most decorated player in the English game, having won 13 league titles, four FA Cups the Champions League twice."
    },
    {
        "Title": "West Ham eases to victory over 2nd-string Watford",
        "Desc": "LONDON, April 21: Mark Noble scored two penalties to help West Ham beat a second-string Watford side 3-1 on Wednesday and maintain its bid for European football when the club moves to the Olympic Stadium next season.The West Ham captain converted either side of halftime, with Watford goalkeeper Heurelho Gomes unable to repeat last weekend's heroics of saving two penalties at West Bromwich Albion.Striker Andy Carroll opened the scoring with his ninth league goal of the season in the 11th minute, steering in a looping Dmitry Payet cross.Defender Sebastian Proedl pulled one back for the visitors, volleying home from a 64th minute free kick.Watford, which faces Crystal Palace in the FA Cup semifinals on Sunday, could have had a second goal - but substitute Troy Deeney saw his 90th minute penalty saved.Watford's lineup reflected the weekend trip to Wembley Stadium, with manager Quique Sanchez Flores choosing to make seven changes.Team captain Deeney was on the bench and forward Odion Ighalo was rested. Not surprisingly, without the potent strike force that has netted 23 times between them this season, Watford lacked an outlet up front.\"We have used a lot of players recently and the plan was to try to conserve and be fit for the weekend,\" the Spanish coach explained as he looked ahead to the match against Palace. \"Practically all of the players will be fit for the weekend.\"Meanwhile, Payet ran the show from midfield, while Carroll and Senegal striker Diafra Sako were a constant handful for the re-shuffled Watford defense, and the result never looked in doubt for the home team.\"I'm really pleased because we played some good football. We dominated from the start and we deserved to win,\" West Ham manager Slaven Bilic said.\"There is everything to play for and we will fight to the end.\"In the club's last season at the Boleyn ground where it has played since 1906, West Ham has now gone 16 consecutive league matches unbeaten at home. It is also undefeated in its last nine league matches, their best run in the top flight since December 1985.The team is sixth in the standings, with four more matches to play, as it bids to secure a place in next season's Europa League."
    },
    {
        "Title": "Liverpool routs Everton 4-0 but striker Origi is carried off",
        "Desc": "LIVERPOOL, England, April 21: Liverpool striker Divock Origi scored before being carried off on a stretcher as Everton was overwhelmed 4-0 in Wednesday's Merseyside derby.Everton defender Ramiro Funes Mori was sent off five minutes into the second half for stamping on Origi, providing a fitness concern for Liverpool ahead of next week's Europa League semifinal with Villarreal.\rEverton is looking forward to a semifinal of its own — Saturday's FA Cup meeting with Manchester United — and this was the worst possible preparation.As well as Funes Mori's dismissal, fellow center back John Stones limped off injured as Daniel Sturridge scored Liverpool's third in the 61st minute.Headers from Origi and Mamadou Sakho gave Liverpool the lead at the end of the first half and Philippe Coutinho's 76th-minute strike completed the rout."
    },
    {
        "Title": "Hard-fought win (photo feature)",
        "Desc": "KATHMANDU, April 18: Skipper Paras Khadka completed century as Nepal defeated Namibia by three wickets in the ICC World Cricket League Championship held at the TU Cricket ground in Kirtipur in a nail-biting thriller on Monday.Nepal reached the 240-run target set by Namibia with one ball remaining.Khadka was top scorer for Nepal at 103 runs. He scored the runs facing 94 balls hitting seven sixes and five fours. Sharad Veswakar remained not out at 74 runs, while Gyanendra Malla contributed 22 runs for Nepal.Sent to bat first after losing the toss, Namibia scored 239 runs losing nine wickets in the alloted 50 overs. Namibian player S Baard top-scored with 51 runs studded with eight fours off 60 balls. Similarly, Zane Green hit 47 runs including six fours off 87 balls while SF Burger made 43 runs off 60 balls and remained not out.Basanta Regmi, Sandeep Lamichhane and Shakti Gauchan took two wickets each conceding 44, 45 and 39 runs respectively.\r \rIn today’s match, Nepal dropped Raju Rijal and included Sagar Pun in the playing eleven.Nepal had defeated Namibia by five-wicket in the first match on Saturday."
    }
]