[
    {
        "Title": "Boxer Ghimire creates ‘world record’ in international boxing",
        "Desc": "KATHMANDU, May 8: Boxer Abiral Ghimire from Nepal has reportedly set a world record for his undefeated participation in the ‘Hit Professional Kick Boxing Tournament’.  He has won the match 14 consecutive times. In the latest match held at Nagoya Congress Center Event Hall at Nagoya city of Japan on Saturday, he won the match against his competitor from Thailand who has also the experience of competing in the K1K Professional Kick Boxing.   Ghimire is known as Himchituwa (Himalayan Cheetah) among the youth community.     According to Ghimire’s coach Dev Ghimire, the player represents the Shimura dojo in the international boxing competition and the match was held on the occasion of its 50th anniversary. (RSS)"
    },
    {
        "Title": "Hangzhou Asian Games postponed until 2023 over COVID",
        "Desc": "NEW DELHI, May 6: The Asian Games scheduled to take place in the Chinese city of Hangzhou in September have been postponed until 2023 because of the COVID-19 situation, the governing Olympic Council of Asia (OCA) said on Friday.The 19th edition of the multi-sports Games, second in size only to the Summer Olympics, was scheduled to take place from Sept. 10-25 in the capital of Zhejiang province, some 175 kilometres southwest of China's financial centre Shanghai.The OCA said in a statement after its executive board meeting in Tashkent that the Hangzhou organising committee (HAGOC) had been well prepared to deliver the Games despite the \"global challenges\".\"However, the ... decision was taken by all the stakeholders after carefully considering the pandemic situation and the size of the Games,\" it added.The new dates for the Games would be announced \"in the near future\".\"The name and the emblem of the 19th Asian Games will remain unchanged, and the OCA believes that the Games will achieve complete success through the joint efforts of all parties.\"Organisers had said in early April that all 56 competition venues for the Games had been completed as the city prepared to host more than 11,000 athletes from 44 nations and territories.\"With the support and guidance of the OCA and the Chinese Olympic Committee, we will continue to do a good job in the preparatory work and believe that the postponed Hangzhou Asian Games will be a complete success,\" HAGOC said on the Chinese version of their website.The Asian Youth Games, scheduled for December in Shantou, have been cancelled altogether. Tashkent will host its next edition in 2025.Shanghai said on Friday it has brought China's worst outbreak of COVID-19 under effective control following a month-long lockdown of nearly 25 million people. read moreOther cities, including the capital Beijing, are facing a wave of additional curbs, frequent testing and targeted lockdowns.Most international sporting events in China have been postponed or cancelled since the start of the pandemic, with the notable exception of the Winter Olympics, which went ahead in Beijing under strict health controls in February.The start of the Chinese Super League football competition has been delayed and the matches, should they go ahead, could be played under closed-loop management, state media reported."
    },
    {
        "Title": "Poornima Shrestha summits Mt Kanchanjunga",
        "Desc": "KATHMANDU, May 5: Photo journalist turned climber Poornima Shrestha has successfully scaled Mt Kanchanjunga, according to Dawa Sherpa of the Seven Summit Treks Private Limited, an expedition company that organized her expedition.They left camp IV on Wednesday night. The team had made it to the top at around 5 PM today.Kanchanjunga is the third highest mountain with an altitude of 8,586 meter.Earlier in October last year, Shrestha scaled Mt Dhaulagiri—the world’s eighth highest peak. She became the first Nepali woman to successfully climb the mountain with an altitude of 8,167 meter.Shrestha has already climbed world’s tallest peak Mt Everest, Mt Manaslu and Dhaulagiri and Mt Annapurna-I.Shrestha plans to scale Mt Lhotse and Mt Makalu."
    },
    {
        "Title": "Head coach Al Mutairi calls additional 17 players for closed camp training",
        "Desc": "KATHMANDU, May 1: Nepali national football team head coach Abdullah Al Mutairi has called in additional 17 players for the closed camp training being held for the preparation of the AFC Asian Cup qualifiers. After the coach fired Rohit Chand in the absence of captain Kiran Chemchong, nine other players left the closed camp training program on Wednesday.Earlier, a 23-member team was included in the closed camp training. However, after the exit of 10 players, Al Mutairi added 17 members to the remaining 13-member squad and announced a 30-member team.After Chand left the camp, players including Sujal Shrestha, Bimal Gharti Magar, Bishal Rai, Anjan Bista, Bishal Shrestha, Dinesh Rajbanshi, Ananta Tamang and Tej Tamang left the training program as well. The dissatisfied players have claimed that after they had demanded basic services and that they were being repeatedly pressured to leave the closed camp.Similarly, the office-bearers, three vice-presidents and a member of the All Nepal Football Association (ANFA) had also demanded that a meeting of the working committee of the national football-governing body be held immediately to resolve the dispute between the national footballers and the head coach. However, the controversy is likely to escalate further after Al Mutairi continued the training program by adding 17 players to the national team."
    },
    {
        "Title": "Demand for immediate convening of ANFA working committee meeting",
        "Desc": "KATHMANDU, April 29: Four office-bearers - three vice-presidents and a member - of the All Nepal Football Association (ANFA) have demanded that a meeting of the working committee of the national football-governing body be held immediately to resolve the dispute between national football players and head coach Abdullah Al Mutairi.Stating that the dispute between the players and head coach is a serious and sensitive matter, Senior Vice-president Pankaj Bikram Nemwang, and vice-presidents Krishna Bahadur Thapa and Bir Bahadur Khadka and Central member Dawa Lama have demanded the working committee meeting.According to Senior Vice President Nemwang, though ANFA President Karma Chhiring Sherpa is willing to discuss the issue, there is no meeting due to which he had to send a letter to ANFA. Stating that some members have already resigned, one-third of the incumbents demanded a working committee meeting on the issue.The 10 members of Nepali national football team have left the closed camp training program being held for the preparation for the AFC Asian Cup qualifiers due to the dissatisfaction against head coach of the team, Abdullah Al Mutairi."
    },
    {
        "Title": "National footballers dissatisfied with coach Al Mutairi",
        "Desc": "KATHMANDU, April 29: Nepali national football team members have expressed their dissatisfaction against head coach of the team, Abdullah Al Mutairi, and said that they had to leave the closed camp being held for the preparation for the AFC Asian Cup qualifiers due to him.Speaking at a press conference on Thursday, the dissatisfied players claimed that after they had demanded basic services, they were being repeatedly pressured to leave the closed camp. According to them, head coach Mutairi had said, “You started the war and I ended it.”  In the absence of captain Kiran Chemjong, Rohit Chand had demanded to provide basic services to the team. However, the coach fired Chand and ignored the demand of the players instead, according to the players. When they put forth a query to the head coach, he claimed that he had no choice and asked them to leave the camp after constant pressure, due to which the players left the hotel.Expressing dissatisfaction with the working style of the coach, the players in the training have also commented that the conduct of Al Mutairi is wrong. All the 10 players who boycotted the closed training session were present at the press conference.Similarly, according to the players, they had informed All Nepal Football Association (ANFA) about the dispute with the coach but no action has been taken despite ANFA president Karma Tsering Sherpa saying that he would inform the players later as elections were approaching. On the other hand, General Secretary Indra Man Tuladhar said that ANFA would study the issue and do the needful.Nepal, which is preparing for the AFC Asian Cup qualifiers, to be held in Kuwait from June 8 to 14, is in a difficult group. The top team of the group will be selected for the Asian Cup 2023 to be held in China. Similarly, the runners-up in five groups will also get a chance to participate in the competition."
    },
    {
        "Title": "Boxer Punam from Nepal wins bronze in Thailand Open",
        "Desc": "KATHMANDU, April 10: Nepal has won a bronze medal in an international boxing tournament held in Phuket of Thailand. Punam Rawal was defeated by her competitor from the Philippines by 2-3 to sign off with the bronze toward the 60-kg women's category in the Thailand Open International Boxing Tournament 2022. Rawal has been with the Nepali Army for the past eight years. The Philippine player also beat her competitor from India in the final and clinched the gold. This is the first international award in boxing for Nepal since 2010.    Chandrakala Thapa, Minu Gurung, Sushma Thapa and Bhupendra Thapa Magar had represented the country in the tournament along with Rawal.  They fought for the title under different weight categories, according to Nepali team coach Prakash Thapa Magar. Nepal's Dhan Kumar Mainali was one of the referees in the tournament."
    },
    {
        "Title": "Chairman Dahal flags off cycling marathon in Chitwan",
        "Desc": "CHITWAN, April 9: CPN (Maoist Center) Chairman Pushpa Kamal Dahal flagged off the 65-km cycling marathon on the banks of Narayani early today. On the occasion, Chairman Dahal said that bicycles are very suitable in all aspects and praised the organizers and the Provincial Sports Development Council of Bagmati for holding the cycling marathon. Stating that the competition attended by the Sports Minister has also established its authenticity and legitimacy, he expressed best wishes to all the participants.There are five categories to vie for in the competition. Elite Men 19 Plus, Elite Women 19 Plus, Master Men 30 Plus, Grand Master Men 50 Plus and Chitwan special, according to Competition coordinator Shanta Kumar Darai. The first place winners will be awarded Rs 45,000 for men and women above 19 years of age, Rs 25,000 for those above 30 years of age, Rs 20,000 for women above 50 years of age and Rs 20,000 each for men and women in Chitwan Special category.According to the organizers, the competition is being held to increase the use of bicycles in the Bharatpur metropolis with the objective of conveying the message that the road project under construction in Bharatpur metropolis is bicycle-friendly and also supports environmental protection.Cyclists from Kathmandu, Hetauda, Pokhara, Bara, Parsa and the APF are participating in the competition."
    },
    {
        "Title": "Nepal reaches final of Triangular T20 Int’l Cricket Series",
        "Desc": "KATHMANDU, March 31: Nepal has reached the final of the Triangular T20 International Cricket Series, defeating Papua New Guinea (PNG) at the Kirtipur-based TU Cricket Ground for a second time in the series on Thursday. In the match, Karan KC made a hat trick by taking three consecutive wickets in the second, third and fourth balls of the last over. This is the first hat trick wicket taken by any Nepali bowler in the T20 International Series.Similarly, Nepal's Dipendra Singh Airee top-scored with 66 off 33 balls with three fours and four sixes. Debutant Adil Ansari played an explosive innings of 33 runs off 11 balls with 1 four and 3 sixes. PNG lost the match by 37 runs."
    },
    {
        "Title": "Triangular T20 Intl Cricket Series: Nepal defeats Malaysia",
        "Desc": "KATHMANDU, March 30: Nepal defeated Malaysia in the second match held today under the Tri-nation T20 International Cricket Series at the Kirtipur-based TU Cricket Ground. Nepal won against Malaysia by six wickets.   With this achievement, hosts Nepal registered a second straight victory in the series.  Nepal on Monday won the opening match against Papua New Guinea by 15 runs. Batting first after winning the toss, Malaysia posted 114-8 and Nepal met the target of 115 in 13.4 overs at the loss of 4 wickets. Aasif Sheikh hit the highest 57 runs with seven fours and one six for Nepal in 37 balls. Dipendra Singh Airee contributed 21 runs followed by 15 from Dilip Nath, 12 from Rohit Poudel and 2 from Kushal Malla. Toward bowling, Pawandeep Singh took two wickets while Syed Aziz and Muhammed Amir claimed one wicket each. Malaysia’s Zubaidi Zulkifle made 32 runs for the team while captain Ahmad Faiz contributed 24 runs followed by 16 from Muhammad Amir, 14 from Syed Aziz, 9 from Sharvin Muniandy and 3 from Vijay Unni. In bowling, Nepal’s captain Sandeep Lamichhane and Karan KC took two wickets each while Airee and Abinas Bohara took a wicket each. Nepal will be meeting Papua New Guinea tomorrow again.(RSS)"
    },
    {
        "Title": "Nepal defeats PNG by 15 runs",
        "Desc": "KATHMANDU, March 28: Nepal beat Papua New Guinea (PNG) by 15 runs in the first match of the triangular T20I Tri-Series 2022 that kicked off today. Chasing a target of 184, Papua New Guinea were all out for 168 in 19 overs.After losing the toss at the TU Cricket Ground, Nepal scored 183 runs for the loss of 9 wickets in the stipulated 20 overs. Nepal's opener Asif Sheikh contributed 43 runs in 35 balls with 5 fours and 1 six. Kushal Bhurtel was dismissed for 20 off 11 balls with 3 fours and 1 six.Nepal will play against Malaysia in the second match on Wednesday and Malaysia and Papua New Guinea will compete with each other on Tuesday. Nepal lost both the ODI matches played between the two countries recently."
    },
    {
        "Title": "Nepal beats Papua New Guinea in ICC Men's Cricket World Cup League-2",
        "Desc": "KATHMANDU, March 22: Nepal beats Papua New Guinea in ICC Men's Cricket World Cup League-2 by seven wickets. Nepal met the target of 174 runs set by Papua New Guinea in 37 overs with a loss of three wickets.While two batsmen each struck half-century for Nepal, Sompal Kami (2/37) and Sandeep Lamichhane (2/29) took the major wickets. The opening batsman of the national team Kushal Bhurtel contributed with 50 runs. He struck four fours and one six of 64 balls. Aarif Sheikh added 53 runs.In the match, Nepal had won the toss and put Papua New Guinea into bat."
    },
    {
        "Title": "‘Surya Nepal NPGA Match Play’ starts from today",
        "Desc": "KATHMANDU, March 8: The fourth competition of the Surya Nepal Golf Tour 2021/022 season 'Surya Nepal NPGA Matchplay' has started at the Royal Nepal Golf Club from today.As many as 16 athletes will be taking part in the tournament which will be held till April 9. The players were selected according to their performances in the 2019/20 season of the competition. The games will be played in 18 holes while the final will be played in 36 holes setting. The winner of the competition will bag a prize pool of Rs 50,000 while the runner-up will receive Rs 30,000. Similarly, the second runner-up will receive Rs 22,000, while the third runner-up will receive Rs 18,000. Likewise, all players who reach the quarter finals will receive Rs 10,000 while those competing in the first round will receive Rs 5,000 each."
    },
    {
        "Title": "Sports should be isolated from politics: Oli",
        "Desc": "JHAPA, March 6: CPN (UML) Chairman KP Sharma Oli has argued that the sports sector should not be part of politics. Addressing the inaugural session of the Fifth Jhapa Gold Cup football tournament at Domalal Rajbansi Stadium on Saturday, Chairman Oli said sport activity is not a political party and it should be kept aside from politics while urging different sides to unite for the development of the sports sector.The Domalal Rajbansi family had given land for the construction of the stadium in Birtamod.Ten different teams are participating in the tournament in which the winner will bag Rs 1,255,000 in cash while the first runner up will get Rs 605,000.The organizer said the most valuable player will get a motorbike while the best goalkeeper, best defender, best midfielder and best coach will receive Rs 21,000 each.The highest scorer striker will get Rs 25,000 in cash. Similarly, the man of the match of each game will receive Rs 9,999.Meanwhile, Oli laid foundation stone for river embankment to be built against Ratuwa river in Kamal Rural Municipality-6 in the district of Jhapa.Oli said the local residents here won't have to bear losses from the Ratuwa river during monsoon after the construction of a well-managed embankment. He also hoped for the timely completion of the embankment, which is 12 km long.(RSS)"
    },
    {
        "Title": "KMC Mayor Shakya inaugurates 7th Edition of Nepal-Pakistan Friendship T20 Cricket Tournament",
        "Desc": "KATHMANDU, March 2: The Pakistan Embassy organized the inauguration Ceremony of the 7th Edition of Nepal-Pakistan Friendship T20 Cricket Tournament 2022 on Wednesday. As many as 12 cricket teams are participating in the nine days event which was inaugurated by Bidya Sunder Shakya, mayor of Kathmandu Metropolitan City (KMC).Addressing the ceremony, Mayor Shakya appreciated the embassy’s initiative for organizing such sports activities. He highlighted the potential of cricket and sports in bringing the youth of the two countries together.Similarly, Ambassador Syed Haider Shah said that in these times of COVID, the importance of sports and outdoor activities had increased further. He said that the growing popularity of cricket in Nepal indicated that it may not be far away from achieving membership of ICC.The tournament is scheduled to conclude on 10 March 2022."
    },
    {
        "Title": "Russia stripped of major events as invasion of Ukraine intensifies",
        "Desc": "Feb 26: As Russian forces moved deeper into Ukraine on Friday, sports bodies moved quickly to strip Russia of events, with St Petersburg losing the Champions League final while the Formula One Grand Prix will not be held in Sochi.Russia launched its invasion by land, air and sea on Thursday following a declaration of war by President Vladimir Putin, with an estimated 100,000 people fleeing as explosions and gunfire rocked major cities.  read more European soccer governing body UEFA decided to relocate the Champions League final -- club soccer's showpiece event -- to the Stade de France in Paris after receiving support from French President Emmanuel Macron.The decision was met with regret by the Kremlin but welcomed by UK Culture Secretary Nadine Dorries.\"Russia must not be allowed to exploit sporting and cultural events on the world stage to legitimise its unprovoked, premeditated and needless attack against a sovereign democratic state,\" Dorries said.Formula One, motorsport's governing body FIA and the teams discussed the situation and came to the conclusion that it was \"impossible to hold the Russian Grand Prix in the current circumstances\".The race, which joined the calendar in 2014, was scheduled for Sept. 25 at Sochi's Olympic Park. On Thursday, both former champion Sebastian Vettel and reigning champion Max Verstappen said it was \"wrong\" to race in Russia.After Poland, Sweden and the Czech Republic refused to play World Cup qualifiers in Russia, UEFA said home games of Ukrainian and Russian club and national teams competing in UEFA competitions would be played at neutral venues.  read more That could affect Spartak Moscow's chances in the Europa League after they were drawn with German side RB Leipzig. The Russian team had the advantage of being seeded for the draw but will now have to play the second leg at a neutral venue.The International Olympic Committee (IOC) urged international sports federations to either move or cancel sports events currently planned in Russia or Belarus.  read more The International Judo Federation (IJF) said it had cancelled its May 20-22 Grand Slam event in Kazan, Russia but in a brief statement IJF President Marius Vizer did not make any reference to Russia or Ukraine.\"The International Judo Federation announces with regret the cancellation of the 2022 Grand Slam in Kazan, Russia,\" said Vizer, who has longstanding ties with Putin, a judoka himself.\"We are saddened by the current international situation, the result of inefficient dialogue at international level.\"Russian troops entered Ukraine through Belarus when the invasion began on Thursday. The IOC added the two countries' flags should not be displayed at sports events.Five World Cup skiing events that were scheduled to take place in Russia this weekend and next month have been cancelled or moved by the International Ski Federation (FIS) in the interest of safety and integrity of the competition.  read more \"Participants are already on site at the two World Cup events that were planned for this weekend and FIS is working closely with the involved stakeholders to ensure their quick return back home,\" it said.'SEPARATE FROM POLITICS'However, there were bodies reluctant to strip Russia of events, with the international volleyball federation (FIVB) saying preparations for the men's world championship to be held in Russia in August were proceeding as planned.  read more \"While the FIVB believes that sport should always remain separate from politics, we are closely monitoring the situation to ensure the safety and wellbeing of all participants at our events which is our top priority,\" the FIVB told Reuters.The FIVB did not say whether there would be any sanctions for the Russian volleyball federation.English Premier League club Manchester United said they have withdrawn Russian airline Aeroflot's sponsorship rights. Aeroflot was banned from flying to the United Kingdom on Thursday with its foreign carrier permit suspended.  read more Finnish ice hockey team Jokerit said they were ending their Kontinental Hockey League (KHL) season ahead of next month's playoffs.The team has regularly qualified for the playoffs but club chairman Jari Kurri said it was \"impossible\" to continue their season in the Russian-based league.The International Tennis Federation also has events scheduled in Russia and Ukraine this year. But it took steps to postpone a World Tennis Tour tournament scheduled to take place in Ukraine in April.The International Chess Federation (FIDE) said the Chess Olympiad and FIDE Congress will not take place in Moscow later this year and were doing their \"utmost to find another organiser for the Olympiad\".The World Curling Federation Board convened an emergency meeting and stripped the Russian city of Perm of the European Curling Championships scheduled for May.Swimming's global governing body FINA called off a men's water polo World League match in St. Petersburg next month while an Artistic Swimming and Diving World Series event scheduled for April in Kazan was cancelled.The Board of European Aquatics also postponed competitions in Russia, including a women's water polo Euro League quarter-final game, to a date and place yet to be confirmed."
    },
    {
        "Title": "Nepal beats Canada by eight wickets",
        "Desc": "KATHMANDU, Feb 21: Nepal defeated Canada by eight wickets at Al Amerat Cricket Ground in Oman at the ongoing ICC T20 World Cup Qualifiers on Monday.With this win, Nepal has reached the semi-finals as the group topper. Sandeep Lamichhane took three wickets giving away only 12 runs in his four-over bowling spell while Kamal Airee and Abinash Bohara took two wickets each.Earlier, Nepal defeated Oman by 36 runs and the Philippines by 136 runs. Similarly, the two teams entering the final will qualify for the ICC Men’s T20 World Cup. The game will be played in Australia from October 16 to November 13."
    },
    {
        "Title": "Nepal-Pakistan Friendship T20 Cricket match in March",
        "Desc": "KATHMANDU, Feb 21: The 7th Edition of the Nepal-Pakistan Friendship T20 Cricket tournament will commence from March 2.The Embassy of Pakistan organized a Trophy Unveiling Ceremony of the Tournament here today. The ceremony was followed by draws for the twelve teams competing in the tournament.The event was attended by representative of the Cricket Association of Nepal Raju Basnet, former Captain of Nepal’s national cricket team Paras Khadka, players, representatives from different cricket academies of Nepal and prominent media representatives.Nepal-Pakistan Friendship T20 Cricket Tournament is a regular feature every year, in which cricket teams from different clubs and academies of Nepal participate. The aim of the tournament is to strengthen people-to-people contacts and to encourage the youth of Nepal to participate in sports activities. The tournament creates a platform for the young cricketers of Nepal to enhance their professional capabilities, the organizers said.While addressing the event, Pakistani Ambassador to Nepal, Syed Haider Shah expressed the hope that the tournament would provide a healthy avenue for young cricketers from Nepal to hone their skills and further promote cricket in Nepal. He further said that the tournament was a testament to the cordial and friendly relations between Nepal and Pakistan and hoped that the tournament would contribute to further deepening these ties, as per the press release issued by the embassy."
    },
    {
        "Title": "Nepal strikes past Philippines by 136 runs",
        "Desc": "KATHMANDU, Feb 19: Nepal has won the match against the Philippines by 136 runs in the ongoing T-20 World Cup Qualifiers held at Oman. A brilliant performance by batsman Kushal Bhurtel, Dipendra Karki, and the bowling team saw the country win its second match in a row at the competition. Nepal had batted first in the game, securing a target of 218 runs for the Philippines to win. While Jordan Algero secured 27 runs for the Philippines, Daniel Smith secured 20 runs for their team, Jonathan Hill managed to secure11 runs. However, other members of the team were not able to secure any two-digit runs for the team. For the Nepali team, Kusal Bhurtel striked a century in the game. The batsman shot 13 fours and 1 sixes in 61 balls, securing a total of 104 runs for Nepal.Similarly, Dipendra Singh Aeri was able to secure 83 runs for Nepal in 46 balls. For the Philippines, Daniel Smith, Gurbhupindar Chauhan, and Migi Podoski took a wicket each from their balling."
    },
    {
        "Title": "Nepal gives a target of 218 runs to Phillippines",
        "Desc": "Nepal gives a target of 218 runs to PhilippinesKATHMANDU, Feb 19: Nepal has given a target score of 218 runs to the Philippines in the ongoing T-20 World Cup Qualifiers, held in Oman. Kusal Bhurtel struck a century in the game. The batsman shot 13 fours and 1 six in 61 balls, securing a total of 104 runs for Nepal.Similarly, Dipendra Singh Aeri was able to secure 83 runs for Nepal in 46 balls. For the Philippines, Daniel Smith, Gurbhupindar Chauhan, and Migi Podoski took a wicket each from their bowling."
    },
    {
        "Title": "Nepal thrashes Oman by 39 runs",
        "Desc": "KATHMANDU, Feb 18: Nepal defeated Oman by 39 runs in the first match of the ongoing ICC T20 World Cup Qualifiers on Friday.Skipper Sandeep Lamichhane, Dipendra Singh Airee and Kamal Singh Airee showed excellent performances in the match. Kamal took three wickets while Sandeep and Dipendra took two wickets each.Oman managed to get only 78 runs on the board losing all wickets in 17 overs, while chasing the 118-run target. Oman had won the toss and elected to field first.Nepal will face the Philippines in their second match on Saturday."
    },
    {
        "Title": "Second leg of Women’s Football League in Biratnagar from April 20",
        "Desc": "MORANG, Feb 18: The second leg of the National Women’s Football League competition is set to kick off in Biratnagar on April 20. An agreement was reached between All Nepal Football Association (ANFA) President Karma Tsering Sherpa and Biratnagar Metropolitan City Mayor Bhim Parajuli to organize the second leg of the league in the metropolis on Thursday. Stating the development of sports along with other sectors is a high priority of the metropolis, “the Biratnagar Metropolis has handed over Rs 4.5 million to ANFA to organize the competition in the city,” Mayor Parajuli informed Republica. On the occasion, ANFA President Sherpa said that the total cost of over Rs 26 million has been estimated to organize the league. As many as eight teams will partake in the competition. The winning team will bag a grand prize of Rs 2 million, while the runner-up will win Rs 1 million. Similarly, the second runner-up will receive Rs 500,000 while the third runner-up will secure Rs 300,000. The prize for 5th place is Rs 100,000. The tournament was originally scheduled for January 29, before being postponed due to the risk of COVID-19. Biratnagar Metropolis, Armed Police Force team, Tribhuwan Army Club, Nepal Police, Syangja Waling Municipality, Lalitpur Metropolis, Chandrapur Municipality and Dhangadhi Sub-Metropolis will be taking part in the competition. The first leg of the competition will kick off in Chitwan on March 24. The first leg of the league will see each team play a total of 28 games, while the second leg will start on April 20 in Biratnagar."
    },
    {
        "Title": "Footballer Hari Khadka found guilty in fake certificate case",
        "Desc": "KATHMANDU, Feb 17: Footballer Hari Khadka has been convicted in a case related to fake educational qualification certificates.A bench of special court judges Abdul Aziz Musalman and Nitya Nanda Pandey on Thursday ruled that the certificate he had submitted to Nepal Police for promotion purposes was fake.The Commission for the Investigation of Abuse of Authority had filed a case at the Special Court on 26 January against former captain of the Nepali national football team Hari Khadka for taking a job in the Nepal Police by submitting fake educational qualification certificates.According to the commission, the investigation has revealed that the proficiency certificate level educational qualification certificate submitted by Khadka is fake. Khadka was posted at the Metropolitan Police Battalion No. 2 and was working as a Sub Inspector of Police at the Central Sports Committee of the National Police Training Academy."
    },
    {
        "Title": "Machhindra Football Club wins Martyrs Memorial 'A' Division  League",
        "Desc": "KATHMANDU, Feb 16: Machhindra Football Club has bagged the title of the Martyr's Memorial 'A' Division League ahead of two matches. Machhindra Football Club beat Satdobato Youth Club 1-0 in the match held at the Dashrath Stadium at Tripureshwar today to win the league. Machhindra is yet to face Three Star Club in the 12th match and Nepal APF Football Club in the last match. However, even if Machhindra Club concedes defeat in these two matches, the team will emerge a winner due to the points that it has secured so far. It has gathered 29 points in 11 matches leaving behind Manang Marshyangdi Club by nine points. Manang has played 10 matches and secured 20 points. Among the 11 matches Machhindra played, it won 9 and ended up in a draw in two matches. Machhindra clinched the title of the League for the second consecutive time.Azerbaijan's Nurlan Novruzov scored the maiden goal for Machhindra in the 53rd minute of today's match which became decisive. Satdobato has collected 15 points in 11 matches and secured the 6th position in the League.Meanwhile, Martyr's Memorial 'B' Division League will begin from March 2 this year, said All Nepal Football Association (ANFA).(RSS)"
    },
    {
        "Title": "Quadrangular T20 Series: Nepal restricts Ireland to 127 runs",
        "Desc": "KATHMANDU, Feb 14: Nepal has restricted Ireland to 127 runs in the T20 cricket match currently underway between the two countries in Oman. In the match held under the Oman Quadrangular T20 Series at Al Amerat, Nepal restricted Ireland to a paltry total after captain Sandeep Lamichanne chose to field first upon winning the toss.Dipendra Singh Airee led the Nepali bowlers in restricting Ireland to 227 runs. He took 4 wickets giving away only 21 runs in his full quota of 4 overs. Likewise, Abinash Bohara took two wickets while captain Lamichhane, Jitendra Mukhiya and Kamal Airee took one wicket each. Ireland posted the total at the loss of 9 wickets. George Dockrell was the top scorer with 28 runs.This is the third match Nepal is playing in the series. It has so far won one against host Oman and lost one against the UAE."
    },
    {
        "Title": "Nepal to meet Oman in first match of Four Nations T-20 Series",
        "Desc": "KATHMANDU, Feb 11: Nepal is competing against Oman on Friday in the first match of the T-20 Series comprising four countries before playing in the ICC T-20 World Cup Global Qualifiers. The match between Nepal and Oman is to take place at 3.45 PM Nepal time at the Al Amerat Cricket Stadium in Oman. Nepal will be playing with the goal of securing a victory. Nepal had played against Oman in the T-20 Series in 2019 before this. Oman had defeated Nepal by six wickets in that match. Nepal will play against United Arab Emirates (UAE) in its second match of the series on Saturday. It will play against Ireland on Monday.Nepal is playing in the Four Nations Series before participating in the Global Qualifiers 'A' under the ICC Men's T-20 World Cup Qualifiers. Along with Nepal, the organizer Oman, the Philippines, Canada, the UAE, Bahrain, Ireland and Germany are in Global Qualifier 'A'. These eight teams are also divided into two groups. Nepal, Canada, the Philippines and Oman are in Group 1 while the UAE, Bahrain, Ireland and Germany are in Group 2.(RSS)"
    },
    {
        "Title": "Lama Tendi Memorial Basketball Tournament to start from Feb 14",
        "Desc": "KATHMANDU, Feb 10: The Nepal Basketball Association (NeBA)is set to organize Lama Tendi Sherpa Memorial Open Men and Women Tournament from February 14. Speaking at a press conference on Thursday, NeBA Chairman Bhim Singh Gurung said that as many as 14 teams from the men’s category and five teams from the female category will be competing in the tournament. According to tournament coordinator Bikash Shahi, there is a high possibility of A navy team from Bangladesh participating in the competition. The men’s category has been divided into four groups as the games will be set in a knockout setting. Meanwhile, the women will compete in a league setting, where the top two teams will compete against each other. Winners from both men’s and women’s categories have a prize pool of Rs 50,000 while the runner-up teams will receive Rs 25,000 cash prize. Similarly, the winner of the Most Valuable Player award will receive Rs 10,000. The tournament will be held at the National Sports Council Covered Hall at Tripureshwor. Lama was a former Chairman of the NeBA. He also served as the Vice-President of National Sports Council and the General Secretary of the Nepal Olympic Committee."
    },
    {
        "Title": "Lawn tennis team to represent Nepal at ITF World Junior Tennis Tournament",
        "Desc": "KATHMANDU, Feb 10: A team of 11 including five players and six from the national team left for Colombo, Srilanka on Thursday to compete in the ITF World Junior Tennis Tournament (Asia Oceania Pre-Qualifying), scheduled to be held from February 14 to February 19. The team were bid farewell and goodluck by two members of the Nepal Tennis Association, Anjan Bista and Naresh Shrestha.  Representing Nepal at the tournament are Raj Bir Pradhan and Boris Adhikari from the men’s category, while Sunira Thapa and Adhya Poudel, and Jenny Khadka will participate in the women’s category. Similarly, Aki Juwen Rawat, Raj Bir Pradhan, and Nischal Kashya will participate in the men’s Junior Davis Cup. During the course, Sunira Thapa, Aisha Dolker Gurung, and Prasansha Moktan will compete in the Junior Billie Jean King Cup, scheduled to take place in Colombo from February 21 to February 26."
    },
    {
        "Title": "6th Orchid Cup to start from Feb 25",
        "Desc": "KATHMANDU, Feb 10: The 6th Orchid inter-school knockout football tournament has been scheduled to start from February 25. As many as 32 teams are set to participate in the tournament, Orchid School Operator Prem Kumar Bujel informed Republica. The top four teams will score a prize pool of Rs 30,000, Rs 20,000, Rs 10,000, and Rs 5000 respectively. The matches will take place at the school’s football ground at Kadaghari. According to Operator Bujel, the tournament has been scheduled to motivate the students who have been stuck to their smartphones due to the ongoing COIVD-19 pandemic."
    },
    {
        "Title": "No large fluctuations in Olympics COVID cases expected, organisers say",
        "Desc": "BEIJING, Feb 7: A sharp drop in COVID-19 cases on Feb. 5 among Beijing Olympics-related personnel was due to fewer arrivals at the airport and organisers said on Sunday that they did not expect any more large fluctuations in infection numbers.China detected 10 new COVID cases among Olympic Games-related personnel on Feb. 5, the organising committee of the Games said. That was down from Feb. 4's 45 cases - the second highest daily tally since arrivals commenced last month.Among the latest cases, four were new airport arrivals, including two athletes or team officials. The remaining six were already in the \"closed loop\", a bubble keeping Games personnel away from the local population during the Feb. 4-20 Olympics.\"With an increased number of arrivals there were more positive cases,\" Huang Chun, the Games' deputy director-general of the office of pandemic prevention and control, told a news conference.\"After the (Games') opening ceremony on Friday there is a drop in arrivals and we have even less inbound flights which means there will be fewer positive cases.\"We hope that we can keep that trend going and there might be just minor fluctuations.\"While reduced arrivals mean a lower risk of infected individuals entering the country, organisers said measures within the \"closed loop\" should remain tight to avoid any internal spread.\"We have to pay attention to measures in the closed loop. We do not see any cluster spread and so far it has not affected the smooth progress of the competitions,\" Huang said.While competitions have not been seriously affected, dozens of athletes have already tested positive and moved into isolation, affecting their preparations and training.\"If we all follow the countermeasures I believe the level of positive cases will remain at relatively low levels,\" Huang said.Almost all of the 2,900 athletes expected at the Games have arrived as well as most of the team support and coaching staff.In contrast to many countries seeking to live with COVID-19, China has isolated itself with a zero-tolerance policy, cancelling nearly all international flights.All Games participants - athletes, team officials, media and staff - arrive on special charter flights and are tested on a daily basis during their stay. They must also remain in the loop, which includes their accommodation as well as the sports venues, at all times."
    }
]