[
    {
        "Title": "UN council backs UN chief's peace effort in its first action",
        "Desc": "\n                                                The U.N. Security Council on Friday unanimously adopted its first statement on Ukraine since Russia's military action began on Feb. 24, expressing \"strong support\" for Secretary-General Antonio Guterres' efforts to find a peaceful solution to the 10-week \"dispute.\" \n                                            ",
        "Date": "6 h ago",
        "Type": "World"
    },
    {
        "Title": "US Supreme Court potential shock move on abortion sends protesters onto Washington streets",
        "Desc": "\n                                                Anti-abortion activists and pro-abortion rights supporters took to the streets of Washington on Tuesday after news that the U.S. Supreme Court may overturn the 1973 Roe v Wade ruling which legalized abortion nationwide. \n                                            ",
        "Date": "03 May, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Lawmaker: Sri Lanka president agrees to remove brother as PM",
        "Desc": "\n                                                Lawmaker: Sri Lanka president agrees to remove brother as PM\n                                            ",
        "Date": "29 Apr, 2022 ",
        "Type": "World"
    },
    {
        "Title": "India's Modi touts development projects in visit to Kashmir",
        "Desc": "\n                                                India's Modi touts development projects in visit to Kashmir\n                                            ",
        "Date": "25 Apr, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Sri Lanka's economic crisis dashes hopes for post COVID-19 tourism recovery",
        "Desc": "\n                                                Sri Lanka's economic crisis dashes hopes for post COVID-19 tourism recovery\n                                            ",
        "Date": "22 Apr, 2022 ",
        "Type": "World"
    },
    {
        "Title": "India's COVID infections hit month-high, one state reports spike in deaths",
        "Desc": "\n                                                India's tally of daily COVID-19 cases nearly doubled on Monday from the previous day to more than 2,000 for the first time in a month, government data showed, and the southern state of Kerala reported a big jump in deaths. \n                                            ",
        "Date": "18 Apr, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Nepal records 19 COVID-19 cases on Wednesday",
        "Desc": "\n                                                Nepal records 19 COVID-19 cases on Wednesday \n                                            ",
        "Date": "13 Apr, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Political change in Pakistan as Shehbaz Sharif seeks to become PM",
        "Desc": "\n                                                Opposition politician Shehbaz Sharif submitted his nomination to be Pakistan's next prime minister to the legislature on Sunday, his party said, after incumbent Imran Khan lost a no-confidence vote in parliament after nearly four years in power. \n                                            ",
        "Date": "11 Apr, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Pink Floyd joins forces with wounded Ukrainian singer in new song",
        "Desc": "\n                                                British rock band Pink Floyd will release a new song on Friday to raise money for humanitarian relief in Ukraine, featuring the vocals of a Ukrainian singer who quit an international tour to fight for his country and was wounded. \n                                            ",
        "Date": "08 Apr, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Ukraine's leader to brief top UN body on alleged massacres",
        "Desc": "\n                                                Ukraine's leader to brief top UN body on alleged massacres\n                                            ",
        "Date": "05 Apr, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Ramadan kicks off in much of Middle East amid soaring prices",
        "Desc": "\n                                                The Muslim holy month of Ramadan — when the faithful fast from dawn to dusk — began at sunrise Saturday in much of the Middle East, where Russia's invasion of Ukraine has sent energy and food prices soaring. \n                                            ",
        "Date": "03 Apr, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Russia hits near Kyiv, other city despite vows to scale back",
        "Desc": "\n                                                Russia hits near Kyiv, other city despite vows to scale back\n                                            ",
        "Date": "30 Mar, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Officials: Taliban blocked unaccompanied women from flights",
        "Desc": "\n                                                Officials: Taliban blocked unaccompanied women from flights\n                                            ",
        "Date": "26 Mar, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Taliban orders girl high schools remain closed, leaving students in tears",
        "Desc": "\n                                                The Taliban on Wednesday backtracked on its announcement that high schools would open for girls, saying they would remain closed until a plan was drawn up in accordance with Islamic law for them to reopen. \n                                            ",
        "Date": "23 Mar, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Chinese envoy says NATO shouldn't expand east",
        "Desc": "\n                                                Chinese envoy says NATO shouldn't expand east\n                                            ",
        "Date": "19 Mar, 2022 ",
        "Type": "World"
    },
    {
        "Title": "China registers over 1,000 new daily COVID cases for fourth day",
        "Desc": "\n                                                China reported 1,860 new local symptomatic COVID-19 cases on March. 15, posting over a thousand for a fourth consecutive day, with most new infections still concentrated in the northeast, official data showed on Wednesday. \n                                            ",
        "Date": "16 Mar, 2022 ",
        "Type": "World"
    },
    {
        "Title": "China's daily local COVID cases top 1,000 as Omicron spreads",
        "Desc": "\n                                                Mainland China reported over 1,000 new COVID-19 infections in dozens of cities, the highest daily count in about two years, with the Omicron variant forcing a northeastern city to go under lockdown and the financial hub Shanghai to close schools. \n                                            ",
        "Date": "11 Mar, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Encircled Ukrainian city plans evacuation again, day after failed ceasefire",
        "Desc": "\n                                                Authorities in the besieged Ukrainian city of Mariupol planned to start evacuating some residents from noon (1000 GMT) under a temporary ceasefire deal, after a similar deal a day earlier collapsed with Russia and Ukraine blaming each other for the failure.\n                                            ",
        "Date": "06 Mar, 2022 ",
        "Type": "World"
    },
    {
        "Title": "UNESCO fears Ukraine harm as Russian culture backlash grows",
        "Desc": "\n                                                An Amsterdam museum said Thursday it has cut its close links to the Hermitage Museum in St. Petersburg and UNESCO warned of damage to Ukraine's cultural heritage, as international cultural institutions stepped up their condemnation of Russia's invasion of Ukraine. \n                                            ",
        "Date": "04 Mar, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Russia pummels Ukraine's No. 2 city as convoy nears Kyiv",
        "Desc": "\n                                                Russia pummels Ukraine's No. 2 city as convoy nears Kyiv\n                                            ",
        "Date": "01 Mar, 2022 ",
        "Type": "World"
    },
    {
        "Title": "China is Russia's best hope to blunt sanctions, but wary",
        "Desc": "\n                                                China is the only friend that might help Russia blunt the impact of economic sanctions over its invasion of Ukraine, but President Xi Jinping's government is giving no sign it might be willing to risk its own access to U.S. and European markets by doing too much. \n                                            ",
        "Date": "26 Feb, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Europe braces for further strife as Ukraine crisis escalates",
        "Desc": "\n                                                Europe braces for further strife as Ukraine crisis escalates\n                                            ",
        "Date": "23 Feb, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Biden now 'convinced' Russia will launch invasion of Ukraine",
        "Desc": "\n                                                US President Joe Biden says he is now \"convinced\" Russian President Vladimir Putin has decided to invade Ukraine and assault the capital, an ominous assessment that emerged as the country's war-torn east saw more attacks that the West said could be designed to establish a pretext for an attack. \n                                            ",
        "Date": "19 Feb, 2022 ",
        "Type": "World"
    },
    {
        "Title": "US says Russia may create pretext to attack Ukraine",
        "Desc": "\n                                                Russia could invade Ukraine at any time and might create a surprise pretext for an attack, the United States said on Sunday, as it reaffirmed a pledge to defend \"every inch\" of NATO territory. \n                                            ",
        "Date": "14 Feb, 2022 ",
        "Type": "World"
    },
    {
        "Title": "COVID cases surpass 400 mln as Omicron grips world",
        "Desc": "\n                                                COVID cases surpass 400 mln as Omicron grips world\n                                            ",
        "Date": "09 Feb, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Olympic teams raise concerns over quarantine hotels",
        "Desc": "\n                                                Olympic teams raise concerns over quarantine hotels\n                                            ",
        "Date": "05 Feb, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Indonesia says Bali to reopen to foreign travellers, again",
        "Desc": "\n                                                Last week, Indonesia opened two islands close to Singapore to visitors from the city-state.\n                                            ",
        "Date": "01 Feb, 2022 ",
        "Type": "World"
    },
    {
        "Title": "Delhi lifts weekend curfew, reopens restaurants as India COVID cases drop",
        "Desc": "\n                                                Delhi lifts weekend curfew, reopens restaurants as India COVID cases drop\n                                            ",
        "Date": "28 Jan, 2022 ",
        "Type": "World"
    },
    {
        "Title": "1-month lockdown lifts in Chinese city, 2M in Beijing tested",
        "Desc": "\n                                                Chinese authorities lifted a monthlong lockdown on the northern city of Xi'an and its 13 million residents Monday as infections subside ahead of the Winter Olympics in Beijing in less than two weeks. \n                                            ",
        "Date": "24 Jan, 2022 ",
        "Type": "World"
    }
]