[
    {
        "Title": "US reaches Copa America quarters with 1-0 win over Paraguay",
        "Desc": "PHILADELPHIA, June 12: The United States advanced to the quarterfinals of the Copa America, getting a first-half goal from Clint Dempsey and surviving DeAndre Yedlin's early second-half ejection to beat Paraguay 1-0 on Saturday night.Dempsey scored his 51st international goal in the 27th minute, but the Americans' defense was upended just three minutes into the second half.\rYedlin got his first yellow in the 47th for a slide tackle from the side into Miguel Almiron near the center circle and then when play resumed raised a foot and charged into Miguel Samudio near a sideline. Chilean referee Julio Bascunan immediately gave a second yellow where USA were down to 10 men. \rMichael Orozco entered to play right back in the 50th, and Dempsey came off as the U.S. prepared to survive an onslaught. With Paraguay applying pressure, U.S. coach Jurgen Klinsmann repeatedly turned to try to spur on the crowd of 51,041.\rParaguay had a chance to go ahead in the 11th minute after American left back Fabian Johnson missed a tackle, creating a 3-on-1 break with only defender John Brooks and Guzan to beat. Brooks made an outstanding slide tackle in the penalty area to knock the ball away from Almiron. Paraguay which lost to Argentina in the semifinals of last year's Copa America, are now eliminated."
    },
    {
        "Title": "Lionel Messi fires Argentina into quarter-finals!",
        "Desc": "CHICAGO, June 11: Argentina raced out to a seventh-minute lead thanks to an unlikely source in centre-back Otamendi.Despite being deemed fit to play by coach Gerardo Martino, Messi was named among the substitutes in Chicago, but the captain came off the bench and took the game by storm to seal Argentina's passage through to the knockout round of the Copa América at Soldier Field.\rScoring a breath-taking second-half hattrick upon his return, Argentina qualifies for the Copa America quarter-finals with courtesy of a 5-0 demolition of 10-man Panama in Group D on Friday.Defender Nicolas Otamendi had given Argentina a seventh-minute lead and after Panama's Anibal Godoy saw red just past the half-hour mark, Messi utilised his team's numerical advantage within eight minutes of his introduction in the 68th minute.\rMessi brought the crowd to their feet 10 minutes later with an exquisite free-kick and he completed his scoring three minutes from time for his 53rd international goal, moving to within three of the all-time record held by Gabriel Batistuta.\rAnd substitute Sergio Aguero scored from close range in the 90th minute as the spirited Panama side was blown away in the second half.\rBack-to-back wins saw Argentina improve to six points, meaning the 14-time Copa winners cannot be eliminated as defending champions Chile and Panama sit three points adrift ahead of their final-game fixture.\rArgentina were unchanged from their 2-1 win over Chile last week, with Messi once again named among the substitutes."
    },
    {
        "Title": "'Ali! Ali!': The Greatest is laid to rest in his hometown",
        "Desc": "LOUISVILLE, Ky., June 11: The Greatest was laid to rest in his hometown Friday after an all-day send-off that was a lot like Muhammad Ali himself — serious at times, but also exuberant, bracingly political, and funny.\rAli made one final journey through the city he adored via a fist-pumping funeral procession through the streets of Louisville.The burial was followed by a star-studded memorial service where the boxing great was eulogized as a brash and wildly charismatic breaker of racial barriers. \"He was a tremendous bolt of lightning, created by Mother Nature out of thin air, a fantastic combination of power and beauty,\" comedian Billy Crystal said in an address that had the crowd of about 15,000 laughing at nearly every turn.\rThe more than three-hour memorial capped nearly a full day of mourning in Louisville for Ali, the three-time heavyweight champion of the world who died last week at 74 after a long battle with Parkinson's disease.\rAn estimated 100,000 people holding signs and chanting, \"Ali! Ali!\" lined the streets as a hearse carrying his cherry-red casket made its way past his childhood home to Louisville's Cave Hill Cemetery, where a private burial service was held.\r\"He stood up for himself and for us, even when it wasn't popular,\" said Ashia Powell, waiting to catch a glimpse of the funeral procession for the man the city once knew as Cassius Clay, before he converted to Islam and shed what he called his slave name.\rThe public memorial at the KFC Yum! Center was packed with celebrities, athletes and politicians, including former President Bill Clinton, Sen. Orrin Hatch, director Spike Lee, former NFL great Jim Brown, Arnold Schwarzenegger, soccer star David Beckham, Whoopi Goldberg and Kareem Abdul-Jabbar.\rIn eulogies that were sometimes laced with political barbs in this presidential campaign season, speaker after speaker paid tribute to Ali as a fearless man of principle, someone who went from being one of the most polarizing figures of the 20th century to one of the most beloved, a source of black pride and a symbol of professional excellence.\r\"I can just hear Muhammad say now, 'Well, I thought I should be eulogized by at least one president,'\" Clinton told the crowd.\rCrystal cracked everyone up with his career-making impersonation of a boastful, fast-talking Ali — and Ali's foil, sportscaster Howard Cosell — and rhapsodized about the fighter's charisma, outspokenness and talent in a way that brought the crowd to its feet.\r\"We've seen still photographs of lightning at the moment of impact, ferocious in its strength, magnificent in its elegance. And at the moment of impact it lights up everything around it so you can see everything clearly,\" Crystal said. \"Muhammad Ali struck us in the middle of America's darkest night.\"\rHe added: \"Ali forced us to take a look at ourselves. This brash young man thrilled us, angered us, confused us, challenged us, ultimately became a silent messenger of peace and taught us that life is best when you build bridges between people and not walls.\"\rKevin Cosby, pastor of a Louisville church, told the crowd that Ali \"dared to affirm the power and capacity of African-Americans\" and infused them with a \"sense of somebodiness.\" He likened Ali to such racial trailblazers as Jesse Owens, Rosa Parks and Jackie Robinson.\r\"Before James Brown said, 'I'm black and I'm proud,' Muhammad Ali said, 'I'm black and I'm pretty,'\" Cosby said. \"Blacks and pretty were an oxymoron.\"\rRabbi Michael Lerner, a political activist and editor of the Jewish magazine Tikkun, brought the crowd to its feet four times with a fiery speech in which he referred to Ali's refusal to be drafted during the Vietnam War — a stand that cost him his boxing title.\r\"Ali stood up to immoral war, risked fame to speak truth to power. The way to honor him is to be like him today,\" Lerner said, railing against anti-Muslim bigotry, drone attacks, the gap between rich and poor, and racist policing.\rEarlier in the day, Ali's casket, draped with an Islamic tapestry, was loaded into a hearse outside a funeral home. The pallbearers included former boxers Mike Tyson and Lennox Lewis and actor Will Smith, who played Ali in the movies.\rAli's nine children, his widow, Lonnie, two of his ex-wives and other family members accompanied the body to the cemetery on the 19-mile drive past the little pink house where he grew up and the museum that bears his name. At one point, the motorcade traveled along Muhammad Ali Boulevard.\rAs the long line of black limousines rolled past, fans chanted like spectators at one of his fights, pumped their fists, stood on cars, held up cellphones and signs, ran alongside the hearse and reached out to touch it. They tossed so many flowers onto the windshield that the driver had to push some of them aside to see the road.\rOthers fell silent and looked on reverently as the champ went by.\r\"I've been crying all week,\" said Mike Stallings, of Louisville, who brought his two young sons to bid farewell to the sports legend who grew up as Cassius Clay. \"As big as he was he never looked down on people. He always mingled among the crowds.\"\rAli chose the cemetery as his final resting place a decade ago. Its 130,000 graves represent a who's who of Kentucky, including Kentucky Fried Chicken founder Colonel Harland Sanders. Family spokesman Bob Gunnell said he will have a simple headstone, inscribed only \"Ali,\" in keeping with Islamic tradition.\rAli himself decided years ago that his funeral would be open to ordinary fans, not just VIPs. As a result, thousands of free tickets to the memorial were made available and were snatched up within an hour.\rPresident Barack Obama was unable to make the trip because of daughter Malia's high school graduation. But White House adviser Valerie Jarrett read a letter from the president at the service in which Obama said Ali helped give him the audacity to think he could one day be president.\r\"Muhammad Ali was America. Brash. Defiant. Pioneering. Never tired. Always game to test the odds. He was our most basic freedoms: religion, speech, spirit,\" Obama said.\rRumors that Donald Trump would attend were quashed Friday morning when Gunnell said the Republican presidential candidate called Ali's widow to say he was unable to make it.\rAround Louisville, a sightseeing company offered tours of Ali's path through the city. Businesses printed his quotes across their billboards. City buses flashed \"Ali — The Greatest\" in orange lights. And a downtown bridge will be illuminated the rest of the week in red and gold: red for his boxing gloves, gold for his 1960 Olympic medal.\r\"I just wanted to show respect to the champ,\" said Martin Dixon, who drove from Warren, Ohio, to watch the funeral procession from Ali's boyhood home. \"He inspired the world. He shook up the world.\""
    },
    {
        "Title": "France's poor defense already an open secret at Euro 2016",
        "Desc": "SAINT-DENIS, France, June 11: It's not a case of whether France's defense will get found out later on in the European Championship against better sides. It's already an open secret.\rThe difference is that better sides will ruthlessly punish France's nervous, creaking back four the way Romania could not in a 2-1 defeat in their Euro 2016 opener on Friday night. While Dimitri Payet's wonderful late goal will rightly grab the headlines, the night could have turned out badly — because France should have fallen behind in the fourth minute, after a calamitous mix up by a fledgling center half pairing featuring the ultra-nervous Adil Rami alongside Laurent Koscielny led to a corner.\rThen, after a couple more lucky escapes, left back Patrice Evra gifted Romania an equalizer midway through the second half.\rFrance's most experienced defender with 74 caps, Evra was a Champions League winner with Manchester United and just won his second straight Italian title with Juventus. But he made the most basic of errors when he tripped up midfielder Nicolae Stanciu.\rOn Thursday, Romania coach Anghel Iordanescu claimed that he had figured out France's shortcomings, and he clearly won the early tactical battle, aiming for the center of France's defense like an arrow.\rPlaying with attacking intent, rather than sitting deep as many observers expected, Romania rattled France. With three coming at them, France was startled and overcompensated by dropping too deep.\r\"We were very timid in the first half and they came for us. It felt like they had 12 players on the pitch,\" Evra said. \"It was the first match, and unfortunately that means there's a bit of apprehension, which saps your energy.\"\rRami did not speak to reporters after the game in the post-match area, walking purposefully through the mixed zone with his mobile phone stuck to his ear.\rThe mix up between him and Koscielny led to the first corner of the match, and it only happened because Rami's lack of pace was evident as much as the lack of communication between a pairing that had started only four matches together prior to the match.\rThose matches came far apart, too.\rThe first two were in November 2011 and June 2012 — and there followed a gap of four years before they were associated together again last month because of injuries to Raphael Varane, Kurt Zouma; while Mamadou Sakho's suspension for a positive doping test meant he was unavailable when Deschamps named his squad on May 12.\rBasically, they've had two friendlies — against Cameroon and a desperately mundane Scotland side — to get ready for Euro 2016.\rIt showed, as did France's lack of bite.\rHaving played only friendly matches since losing to Germany in the World Cup quarterfinals two years ago, France — although it did create chances — was second to the ball too often In a sloppy first half.\rRami looked scared, which did not help Koscielny — who is used to playing alongside the ultra-calm Varane — and it also unbalanced the team, with France playing around Rami rather than through him.\rEven the technically assured Payet, selected to play wide left, was coming across to the right flank to help bring the ball out.\rPogba, billed as France's midfield dynamo, was playing almost as a sweeper at times. This was to compensate for Rami's lack of speed — illustrated when the Sevilla player was caught out of position after 15 seconds of the second half. Two minutes later, he was out of position again on a cross and the unmarked Bogdan Stancu volleyed wide.\rAnother reprieve, following on from the one early in the match when Stancu shot straight at goalkeeper Hugo Lloris from two years out.\rIt couldn't last, though, and Stancu leveled from the penalty spot after Evra's gaffe.\r\"It's because of me that we conceded a goal,\" the 35-year-old Evra said. \"We need wins like this, but I don't want to suffer like this in every game.\"\rAlbania is up next for France on Wednesday in Marseille — which shouldn't prove too much of a headache for Rami.\rBut in the latter stages, without the assured presence of Varane or the speed of Sakho, then France could be exposed with the heavy-set Rami — whose sluggishness will have strikers salivating at the prospect of running at him."
    },
    {
        "Title": "Payet lifts France over Romania 2-1 in Euro 2016 opener",
        "Desc": "SAINT-DENIS, France, June 11: After scoring one goal and setting up another in France's opening win at the European Championship, Dimitri Payet left the field in tears.\rThe West Ham forward, now hitting his career peak at 29, was playing for his country at a major tournament for the first time. He thrived, playing a part in both goals as France beat Romania 2-1 Friday at the Stade de France. \"There was a lot of stress, a lot of pressure,\" said Payet, who came off in injury time to a standing ovation. \"If someone had told me it would have gone like, that I wouldn't have believed it.\"\rPayet wasn't even in the squad on Nov. 13 when the Stade de France was hit by extremists during a friendly match against Germany — part of devastating attacks across Paris that are at the heart of national emotions for Euro 2016.\rBut his stunning season in England with West Ham persuaded coach Didier Deschamps to bring Payet back into the team, and France was rewarded with a display of artistry.\rAgainst Romania, Payet capped an outstanding display by curling in an 89th-minute shot with his left foot from outside the penalty area to restore France's earlier lead.\r\"He's capable of doing extraordinary things,\" Deschamps said. \"It was a superb goal.\"\rRiding its luck from wasteful Romanian finishing, France went ahead in the 58th when Olivier Giroud headed in Payet's cross from the right.\rThe lead lasted only seven minutes. Romania forward Bogdan Stancu slotted in from the penalty spot after a foul by Patrice Evra.\rWhile many expect France midfielder Paul Pogba to shine at Euro 2016, Payet was France's main creative force.\rRoaming free on both wings, Payet created Giroud's first headed chance in the 10th, then fired a low cross that Antoine Griezmann met with a shot deflected wide.\rWhen Pogba was freed to move forward in the 57th, he was picked out near the penalty spot by Payet for a volleyed shot that Romania goalkeeper Ciprian Tatarusanu blocked with his legs.\rWithin a minute, Tatarusanu was outmuscled in the air by Giroud, whose header looped into an unguarded goal. It was the forward's 18th goal for France in his 50th appearance.\rIn Pogba's deeper role, his perfectly angled pass set right back Bacary Sagna free to cross and cause confusion that led to Griezmann's header against the post in the 14th minute.\rPayet was in a classic playmaker No. 10 role when Pogba was substituted with 15 minutes left.\r\"I'm not going to be too hard on him, but clearly his potential is such that he can contribute more than he showed tonight,\" Deschamps said.\rBefore Stancu scored his penalty, he lacked composure when spurning clear chances in each half as Romania pressed the favored French hard.\rFrance goalkeeper Hugo Lloris crouched on his goal-line in the fourth minute to block Stancu's close-range shot at the far post after a corner.\r\"Had we scored that would have changed the whole match,\" Romania coach Anghel Iordanescu said. \"At the start of the second period we got in to the box a great deal and unfortunately Stancu missed that chance once again.\"\rFor his second miss, Stancu volleyed weak and wide when left alone in space from eight meters out.\rRomania arrived at Euro 2016 with the meanest defense in the entire qualifying competition, conceding just two goals in 10 matches. It took Payet's class to double that tally."
    },
    {
        "Title": "Mahesh working for comeback on national duty",
        "Desc": "KATHMANDU, June 11: Mahesh Chhetri, opening batsmen cum wicket keeper of Nepali cricket team, who has spent 12 years playing for Nepal, is working hard to see himself in the national team, six months after his exclusion from national duty. \rMahesh, nicknamed Mahi, was in the squad for the match against Papua New Guinea during World Cricket League Championship in November last year.But he has been an outsider for national team since then. However, he spent more than four months playing club cricket in New York, USA. Nepal played only two matches of the championship (third round) against Namibia between the periods. Nepal hosted Namibia in April and beat the visitors on both the legs played at the TU cricket ground, Kirtipur. Now, Nepal is scheduled to play two matches of the Championship against the Netherlands on August 13 and 15.\r“I am quite sure of making in the team as I have been spending enough time practicing with national players at the Tribhuvan University Ground in Kirtipur,” said Mahesh, 28, who first appeared for national team during age group tournament -- U-15 Asia Cup cricket held in 2002 in the United Arab Emirates. However, he believes that there was a tough competition to make a place in the team as young players were also doing extremely well in the recent time.  “There are numbers of wicket-keepers and making a place in the national squad is a challenging job. However, I am confident of making comeback in the team against Kenya in the very next match, if not against the Netherlands” he added. \rA resident of Nepalgunj, he also played ICC U-19 World Cup twice in 2006 and 2008 and was the part of the team which won Plate Championship in 2006. \rNepal had defeated New Zealand by one wicket to win Plate Championship in 2006 World Cup held in Sri Lanka which Mahesh describes as one of the biggest achievement of his cricket career. Nepal had also defeated Test team South Africa in the competition.\r“Winning Plate Championship and beating teams like New Zealand and South Africa were happiest moment as a player. We defeated the Kiwis squad studded with current international stars like Martin Guptill and Tim Southee,” recalls Mahesh. \rSon of retired employee of Nepal Bank Limited, Sanjay Kumar Chhetri and Parbati Chhetri, Mahesh is also an employee of Nepal Army and also plays for Tribhuvan Army Club in domestic cricket. \rMahesh debuted for the national team in 2006 during ACC Trophy held in Malaysia where he scored 39-ball 56 runs in a match against Bhutan. Since then he had a glittering career as a cricketer and left impressive mark in the national squad. \rMarried to Binita Pariyar around three years back, he says that he has been getting full support from his family members since he took up cricket. “My father was a karate player and there was sports friendly environment in my family. I used to think of being a karateka during my childhood. However, one of my close friends used to play cricket and I followed him which later became a turning point in my career,” he said.\rThough he is not much worried about the suspension and controversies of the Cricket Association of Nepal, he laments at the structure of domestic cricket. “Controversies regarding the CAN is an issue related to government. Players should focus on playing matches and I am sure good time will come. However, the controversies have hit domestic cricket events. Due to these frictions emerging players are not getting platform to show their talents,” added Mahesh, who left formal education at Intermediate level to focus on cricket."
    },
    {
        "Title": "Siddhartha Vanasthali wins football final",
        "Desc": "KATHMANDU, June 10: Siddhartha Vanasthali recorded 2-0 win over Bal Srijanalaya to win Pool A final of the Coca Cola Inter-school Football Tournament at Sano Gaucharan in Kathmandu on Friday.Diwakar Chaudhary and Pravin Sunuwar scored a goal each for Siddhartha. \rIn other matches of the day, Pearl English Academy recorded 5-1 win over Prerana English School. Sabin Khadka scored a hat-trick, while Rojan Tamang scored two goals for Pearl. Sushil Ghimire scored the only goal for Prerana. Similarly, Adarsha School beat Advance Academy by 2-0 with Sagar Kapali scoring both goals."
    },
    {
        "Title": "Sanepa overcomes two goal deficit to beat Nawa Jyoti 3-2",
        "Desc": "KATHMANDU, June 10: Sanepa Club moved to the fourth positions in Group A beating Nawa Jyoti Yuva Pariwar 3-2 in the Martyr's Memorial C Division Football League at the ANFA Complex, Satdobato on Friday. Similarly, Khalibari Youth Club recorded its first victory in Group B.\rIn Group A match, Nava Jyoti took early lead as Uttam Bahadur Mahato scored in 23rd minute and doubled the advantage in 29th minute. However, Nava Jyoti failed to keep the lead as Sanepa's Prabesh Joshi cut the deficit in 33rd minute through penalty and Roshan Silwal made it 2-2 in 72nd minute. With the win, Sanepa collected six points from five matches, while Nava Jyoti is at the bottom of the six team's group with four points from five matches.\rShree Bhagawati (10 points), Swayambhu (9 points) and Jhamsikhel (7 points) hold the top three positions, respectively.\rSimilarly, Khalibari beat Sano Gaucharan Youth Club 3-1 to record the first win in Group B. \rKhem Raj Tamang's 44th minute goal gave Sano Gauchan a lead, however Khalibari bounced back to score three goals.\rKapil Gurung leveled the score in 45+4 minute and Kumar Sunuwar doubled the advantage in 55th minute through penalty. Finally, Sandip Shrestha scored in the 63rd minute to secure Khalibari's victory.\rKhalibari moved to the sixth position with the win by collecting four points from six matches. Sano Gaucharan is in the fourth position with six points from five matches."
    },
    {
        "Title": "NSJF beats Gorkha Brewery",
        "Desc": "KATHAMDNU, June 10: Nepal Sports Journalists' Forum (NSJF) overcame Gorkha Brewery 4-2 in a friendly match played on Friday at the Armed Police Force Headquarters at Halchowk, Kathmandu. \rThe match was organized to mark the opening of Euro 2016 scheduled to kick off on Friday midnight. Subas Humagain was on target twice for the NSJF.Adarsha Dhakal and Ayush Khadka also scored a goal each for the winners. Nirbhik Pradhan and Shikhar Shrestha netted for Gorkha Brewery. Gorkha Brewery is the authorized distributor of Carlsberg, the official beer of Euro 2016. The European Championship kicks off on Saturday morning with hosts France taking on Romania. Gorkha Brewery Marketing Manager Baibhav Sharma said that the match was organized to celebrate the beginning of Euro 2016."
    },
    {
        "Title": "Nothing less than Euro 2016 victory will do for Germany",
        "Desc": "EVIAN-LES-BAINS, France, June 10: Nothing less than winning will do.\rGermany's quest for a record fourth European title, only two years after winning a fourth World Cup, begins Saturday against Ukraine in Lille.\r\"We should write a new story and bring the fourth European Championship star to Germany,\" said team manager Oliver Bierhoff, whose golden goal in the 1996 final against the Czech Republic secured a 2-1 win and Germany's last title Germany coach Joachim Loew has at his disposal most of the players that won the 2014 World Cup final in Rio de Janeiro. Jonas Hector, a 26-year-old left back, is the only addition to the squad.\rManuel Neuer, who is likely to captain the side in the Group C opener against Ukraine, said the team would be looking at France's match against Romania for the opening game before concentrating on its own.\r\"The atmosphere in the team is very good,\" the Bayern Munich goalkeeper said. \"We can hardly wait to get on the pitch.\"\rGermany's preparations have been hampered, as has become customary, by injuries, with Borussia Dortmund players Marco Reus and Ilkay Gundogan ruled out with groin and knee injuries, respectively. Roma defender Antonio Ruediger tore a cruciate ligament in his right knee in training on Tuesday, giving Bayer Leverkusen center back Jonathan Tah received a late call-up.\rThe 20-year-old Tah's addition ensured Germany will have the youngest side at Euro 2016 with an average age of 25.81 years, marginally younger than England's squad with an average age of 25.84.\rGermany captain Bastian Schweinsteiger returned as a substitute against Hungary last Saturday after almost three months out with his second serious knee injury of the year - there are still doubts over his match fitness - and defender Mats Hummels is still working his way back from a calf injury. Defensive lynchpin Jerome Boateng has fully recovered from his injury problems.\rGermany has to deal with a few bumps since winning the World Cup, most notably the retirement of defenders Philipp Lahm and Per Mertesacker, and veteran forward Miroslav Klose, the country's all-time leading scorer with 71 goals.\rQualification for Euro 2016 was not straightforward, with a labored win over Scotland followed by a loss to Poland and a draw against Ireland. Germany then lost to Ireland in the return game in Dublin.\rSince qualifying, Germany has lost friendly games to France, England and most recently Slovakia in Augsburg, while beating Italy and Hungary. Nine goals conceded in five games shows Loew has some questions over his defense.\r\"If we play to our strengths on Sunday we'll have a good game and a strong start to the tournament,\" said Loew, who is hoping a strong midfield and attack will help make up for any defensive frailties.\rUkraine is looking to wide men Andriy Yarmolenko and Yevhen Konoplyanka to lead the side in only its second European Championship after qualifying as co-host in 2012. Both wingers are sure to test Hector and whoever Loew decides to employ at right back.\rCentral defender Yevhen Khacheridi is key to the Ukrainians' defensive performance, closing down opposing attackers' space and building from the back, while Dynamo Kiev teammate Denys Garmash provides order in midfield.\rGermany has yet to lose in five games, including four competitive matches, against Ukraine."
    },
    {
        "Title": "Euro Cup 2016 kicks off today!",
        "Desc": "PARIS, June 10: The second big continental soccer championship of the summer has certainly heated up the world. Hosts France are set to face Group A opponents Romania at the Stade de France amid an unprecedented security operation, weather and strike fears.France remains as the state of emergency due to last November's attacks on Paris, when 130 people were killed.More than 90,000 police, soldiers and private guards will be deployed to ensure security throughout the tournament, with seven million fans expected to visit the 10 host venues. The game is set to kick off at 12:45 AM, NST. It is to be broadcast by Sony ESPN network in Nepal and India."
    },
    {
        "Title": "Ali to return to his old Kentucky neighborhood 1 last time",
        "Desc": "LOUISVILLE, Ky., June 10: Muhammad Ali will return to his old Kentucky neighborhood one last time.\rAli's body will ride in a miles-long procession spanning his life — from his boyhood home where he shadowboxed and dreamed of greatness to the boulevard that bears his name and the museum that stands as a lasting tribute to his boxing triumphs and his humanitarian causes outside the ring. Louisville is accustomed to being in the limelight each May when the Kentucky Derby at Churchill Downs captures the world's attention. But the send-off for the three-time heavyweight champion and global advocate for social justice looms as one of the city's most historic events.\r\"We've all been dreading the passing of The Champ, but at the same time we knew ultimately it would come,\" Louisville Mayor Greg Fischer said. \"It was selfish for us to think that we could hold on to him forever. Our job now, as a city, is to send him off with the class and dignity and respect that he deserves.\"\rAli died last Friday at 74 after a long battle with Parkinson's disease. The procession and memorial service follow a traditional Muslim funeral service held Thursday afternoon. The faithful traveled from all over the world to pay their respects.\rThousands more are expected to line the procession route Friday to wave a final goodbye to the city's favorite son. The motorcade will begin at the funeral home and head north onto the interstate. It will pause briefly as it overlooks the Muhammad Ali Center in the heart of downtown.\rThe cars will head west onto Muhammad Ali Boulevard, pass the Kentucky Center for African-American Heritage and visit his childhood home on Grand Avenue. Then it will turn toward his final resting place. Officials predict a 90-minute tour.\rThe procession ends at Cave Hill Cemetery where his family and closest friends will gather for a private burial.\rAt 2 p.m., thousands will gather at the KFC Yum Center a final send-off befitting The Greatest.\rThe service will feature a eulogy by former President Bill Clinton, a longtime friend, and remarks by comedian Billy Crystal, television journalist Bryant Gumbel and the champ's wife, Lonnie. The king of Jordan and president of Turkey will attend.\rPresident Barack Obama was unable to make the trip because his daughter, Malia, is graduating from high school. Valerie Jarrett, a senior White House adviser, will read a letter Obama wrote to Ali's family at the service.\rThe memorial is expected to draw 15,000 people and will bookend a weeklong series of planned services and spontaneous celebrations.\rThe Ali Center stopped charging people for admission. A tour company began impromptu tours of Ali's path through the city. Businesses printed his quotes across their billboards. City buses flashed \"Ali - The Greatest\" in orange lights across their marquees. A downtown bridge said it would be lit the rest of the week in red and gold: red for his gloves and gold for his medal.\rHow can the storied life of a man revered by fans worldwide be encapsulated in a two-hour service? As it turns out, Ali called the shots.\rYears ago, the champ signed off on how he wished to say goodbye to the world. One of his mandates was that ordinary fans attend, not just VIPs. Thousands of free tickets were snatched up within an hour, many fans waiting hours for the chance to witness history.\r\"Everybody feels a sense of loss with Ali's passing,\" said Mustafa Abdush-Shakur, who traveled from Connecticut to pay tribute to him. \"But there's no need to be sad for him. We're all going to make that trip.\""
    },
    {
        "Title": "Suarez officially ruled out as Uruguay faces talented Mexico",
        "Desc": "GLENDALE, Ariz, June 5: Mexico might have its best team ever to compete in the Copa America, and its opening game will be against a Uruguay team without its best player.\rAt a news conference Saturday evening, Urugauy coach Oscar Tabarez officially ruled out Luis Suarez for Sunday night's match.\r \"He is a footballer that always surprises us with his recovery,\" Tabarez said, \"but he is not ready yet.\"\rSuarez injured a hamstring two weeks ago.\rTabarez's comment came about an hour after Mexico coach Juan Carlos Osorio said he wouldn't be surprised if Suarez plays, calling him \"one of the top five forwards of the world.\"\rNow Uruguay — a 15-time champion in a competition known as the South American championship for most of its existence — will be a clear underdog against a deep, talented Mexico team that is on a 19-game unbeaten streak and hasn't been scored upon in the last 730 minutes.\rOsorio talked of a goal of finishing in the top three in the Copa America competition, and could do better than that. Mexico joins Argentina and possibly Brazil as favorites for the \"Centanario\" edition of Copa America, commemorating the 100 years since the competition began.\rMexico has made it to the Copa America finals twice but never has won.\r\"Right now we believe we are a good enough team to make it possible,\" midfielder Andres Guadardo said.\rIt could be the toughest match in Group 3 for either team, and Mexico is at home away from home in its U.S. matches. It had big, supportive crowds in friendlies in Atlanta and San Diego and could get a bigger, more boisterous pro-Mexico gathering at University of Phoenix Stadium Sunday night.\r\"We have a lot of fans here and we feel it,\" defender Jorge Torres Nilo said. \"But when you have the crowd and things like that, it's not the difference in what happens on the field. Basically there's just going to be way more people supporting us and that's it.\"\rTorres Nilo said the players \"try not to think about the winning streak much. A streak is a game-by-game thing.\"\r\"To win we have to beat a high-caliber team with big-time players,\" he said. \"It's not going to be an easy match.\"\rOsorio has kept opponents guessing with a variety of lineups.\rTabarez said he has a suspicion of what Mexico will do but doesn't know for certain.\rUruguay defender Jose Mariz Giminez said he is fine with his team being the underdog.\r\"We don't want to be the favorite for a moment,\" he said. \"We'll do the same work we always do. We try to ignore all the other stuff.\"\rDespite speculation to the contrary, Uruguay players had always said they expected to be without Suarez and were preparing with that in \rmine.\r\"We knew we weren't going to have him from the start,\" midfielder Egidio Arevalo Rios said. \"We'll do the best we can without him. When teams know they won't have to face Luis Suarez they might feel OK, but we have others who can step in.\"\rUruguay defender Jose Mariz Giminez said he is fine with his team being the underdog.\r\"We don't want to be the favorite for a moment,\" he said. \"We'll do the same work we always do. We try to ignore all the other stuff."
    },
    {
        "Title": "IPL: KKR clinch thriller, hand Pune fourth straight defeat",
        "Desc": "PUNE, April 25: In a game of fluctuating fortunes, Supergiants posted a decent looking 160 for five after being put in to bat. KKR maintained a high net run-rate right from the start and, although they lost wickets regularly, were able to cross the finishing line with three balls to spare. Umesh Yadav turned out to be the man of the moment as he smacked Thisara Perera in the long on stands, with his team needing five runs off four balls, with just two wickets in hand.In a game dominated by two Mumbaikars from the either side, Suryakumar Yadav played a defining knock of 60 (43 balls, seven fours, two sixes), while Ajinkya Rahane’s 52-ball 67 for the Supergiants went in vain.\rYadav was in superb touch, despite losing the team's highly successful opening duo of Gautam Gambhir and Robin Uthappa inside the first three overs. Yadav, batting at No 3, kept attacking, and helped his team to 59 for 2 by the end of the Powerplay.Dhoni introduced Rajat Bhatia right after the Powerplay, and the experienced cricketer pulled things back for the hosts. Just 22 runs came from the next five overs, with Bhatia bowling three of them, and getting the wicket of Shakib Al Hasan.The likes of Yusuf Pathan (36 off 27 balls), Andre Russel (17 off 11 balls) R Sathish (10 from 8 balls) all made useful contributions to make KKR the favourites in the chase.\rFor Supergiants, it was their fourth successive loss, and puts them under more pressure now, going into their next game against Sunrisers Hyderabad in Hyderabad.Earlier, Ajinkya Rahane’s 67-run knock was the backbone of the Supergiants innings. Rahane played a very similar knock to the one against RCB a couple of nights ago, when he scored 60 off 46 balls in an unsuccessful chase. Rahane hit boundaries with relative ease, while some of the other Supergiants batsmen struggled, especially during the first 15 overs. The Powerplay overs yielded the hosts just 31 runs, which was a bit of a setback.Rahane and Steve Smith added 66 runs for the second wicket off 50 balls to set the platform for the big hitters. And the big hitters didn’t disappoint, with Thisara Perera (12 runs from 9 balls), Albie Morkel (16 runs off nine balls) and skipper Dhoni (23 not out from 12 balls) all making a contributions.Supergiants added 60 runs off the last five overs. Dhoni plundered Morne Morkel for 17 runs in the final over off the innings, including two fours and a six. It looked a par score, but wasn’t quite enough in the end."
    },
    {
        "Title": "Leicester's Vardy backed by Hodgson as he faces extended ban",
        "Desc": "LONDON, APril 21:England coach Roy Hodgson backed Jamie Vardy on Wednesday, saying the Leicester striker did not dive in the incident that led to him being sent off last weekend and sympathizing with his angry response to the referee.Hodgson's employer, the English Football Association, charged Vardy with improper conduct over his reaction to the red card in Sunday's 2-2 draw with West Ham.\rVardy is set to have his standard one-match ban extended by the FA if he is found guilty. That could damage Leicester's bid for the title, with the team five points clear of Tottenham with four games remaining.Vardy, though, could now use Hodgson as a character witness. Leicester's top scorer tangled with Angelo Ogbonna before going down in the penalty area early in the second half.\"I don't see that as a dive,\" Hodgson said. \"I think he was unbalanced. I don't think it was a penalty either, I think he was unbalanced, running at that speed.\"I think there was a very slight sort of contact with the defender, who was trying to cover.\"Vardy confronted referee Jon Moss, jabbing a finger at the match official while appearing to express his anger at receiving his first red card of the season.\"I sympathize with him, I think he was very, very unlucky,\" Hodgson said. \"But now he has had to swallow the fact that he has been made to leave the field and then, unfortunately, he has reacted like sometimes human beings react.\"He hasn't just said to the ref, 'Thanks very much, I understand' and shakes hands and 'Have a good game'. He has called him a few names, but he is a human being and that can happen.\"Vardy seems certain to be in Hodgson's plans for the European Championship in June and July after leading Leicester's stunning pursuit of a first-ever top flight title, scoring his 22nd goal of the season before being dismissed on Sunday."
    },
    {
        "Title": "Leicester winger Mahrez voted England's player of the year",
        "Desc": "LONDON, APril 25: Leicester winger Riyad Mahrez became the first African to be named English football's player of the year on Sunday, straight after the Algerian helped his team close in on the Premier League title.Mahrez was flown by helicopter to the Professional Footballers' Association ceremony in London after scoring his 17th goal of Leicester's astonishing title charge as the leaders beat Swansea 4-0 at the King Power Stadium in central England.\rMahrez was on a six-man shortlist including Leicester teammates Jamie Vardy and N'Golo Kante for the vote of their fellow professionals in English football.\"I'm very grateful to receive this award,\" Mahrez said. \"It's extra special because if the players vote for me, it's because they've seen I've been great this year, so I'm happy. But it's more team things. Without my teammates I wouldn't get this award.\"The 25-year-old Mahrez is only the second winner of the PFA award from outside England. Uruguay striker Luis Suarez won it in 2014 while playing for Liverpool.Unlike Suarez, Mahrez was an unknown when he moved to England two years ago, joining Leicester from second tier French side Le Havre for less than 500,000 pounds (then about $820,000).The transfer now seems one of the best bargains ever in English football, where the record fee is the 59.7 million pounds (then $99 million) that United paid for Angel Di Maria in 2014 before selling the winger the following year.Mahrez has provided inventiveness and flair to Leicester's attacking play, contributing not only goals but also 11 assists to help transform a team that fought for Premier League survival last season. Now a guaranteed starter, Mahrez was an unused substitute this weekend a year ago when Leicester beat Burnley to finally escape the relegation zone.Leicester started the season as a 5,000-1 title outsider but is now set to become English football's first maiden championship winner since Nottingham Forest in 1978.\"The secret has been team spirit,\" Mahrez said. \"We work so hard for each other. We are like brothers, it's everywhere on the pitch. That's our strength.\"If sometimes we are not good, we know we are going to run and make the effort for our teammates.\"The team, which is owned by Thai duty free retail giant King Power, will be guaranteed the Premier League trophy by winning two of its remaining three games.Only Tottenham can now deny Leicester the title. The second-place London team is eight points behind ahead of Monday's game against West Bromwich Albion after also mounting a surprise title bid.A Tottenham player picked up the PFA ceremony's second-biggest accolade after 20-year-old midfielder Dele Alli was voted young player of the year.Alli, who was playing in the third tier last season with MK Dons, has made an instant impact in the Premier League, scoring 10 goals and providing 12 assists. He was unable to attend the ceremony because he was preparing with his teammates to face West Brom. Ryan Giggs became the latest illustrious Manchester United great to be handed the PFA award for \"meritorious service to football,\" following in the footsteps of former managers Alex Ferguson and Matt Busby, and European Cup winner Bobby Charlton.The former winger, who was voted PFA player of the year in 2009, is now assistant manager to Louis van Gaal at Old Trafford.Giggs made a club record 963 appearances for United and remains the most decorated player in the English game, having won 13 league titles, four FA Cups the Champions League twice."
    },
    {
        "Title": "West Ham eases to victory over 2nd-string Watford",
        "Desc": "LONDON, April 21: Mark Noble scored two penalties to help West Ham beat a second-string Watford side 3-1 on Wednesday and maintain its bid for European football when the club moves to the Olympic Stadium next season.The West Ham captain converted either side of halftime, with Watford goalkeeper Heurelho Gomes unable to repeat last weekend's heroics of saving two penalties at West Bromwich Albion.Striker Andy Carroll opened the scoring with his ninth league goal of the season in the 11th minute, steering in a looping Dmitry Payet cross.Defender Sebastian Proedl pulled one back for the visitors, volleying home from a 64th minute free kick.Watford, which faces Crystal Palace in the FA Cup semifinals on Sunday, could have had a second goal - but substitute Troy Deeney saw his 90th minute penalty saved.Watford's lineup reflected the weekend trip to Wembley Stadium, with manager Quique Sanchez Flores choosing to make seven changes.Team captain Deeney was on the bench and forward Odion Ighalo was rested. Not surprisingly, without the potent strike force that has netted 23 times between them this season, Watford lacked an outlet up front.\"We have used a lot of players recently and the plan was to try to conserve and be fit for the weekend,\" the Spanish coach explained as he looked ahead to the match against Palace. \"Practically all of the players will be fit for the weekend.\"Meanwhile, Payet ran the show from midfield, while Carroll and Senegal striker Diafra Sako were a constant handful for the re-shuffled Watford defense, and the result never looked in doubt for the home team.\"I'm really pleased because we played some good football. We dominated from the start and we deserved to win,\" West Ham manager Slaven Bilic said.\"There is everything to play for and we will fight to the end.\"In the club's last season at the Boleyn ground where it has played since 1906, West Ham has now gone 16 consecutive league matches unbeaten at home. It is also undefeated in its last nine league matches, their best run in the top flight since December 1985.The team is sixth in the standings, with four more matches to play, as it bids to secure a place in next season's Europa League."
    },
    {
        "Title": "Liverpool routs Everton 4-0 but striker Origi is carried off",
        "Desc": "LIVERPOOL, England, April 21: Liverpool striker Divock Origi scored before being carried off on a stretcher as Everton was overwhelmed 4-0 in Wednesday's Merseyside derby.Everton defender Ramiro Funes Mori was sent off five minutes into the second half for stamping on Origi, providing a fitness concern for Liverpool ahead of next week's Europa League semifinal with Villarreal.\rEverton is looking forward to a semifinal of its own — Saturday's FA Cup meeting with Manchester United — and this was the worst possible preparation.As well as Funes Mori's dismissal, fellow center back John Stones limped off injured as Daniel Sturridge scored Liverpool's third in the 61st minute.Headers from Origi and Mamadou Sakho gave Liverpool the lead at the end of the first half and Philippe Coutinho's 76th-minute strike completed the rout."
    },
    {
        "Title": "Hard-fought win (photo feature)",
        "Desc": "KATHMANDU, April 18: Skipper Paras Khadka completed century as Nepal defeated Namibia by three wickets in the ICC World Cricket League Championship held at the TU Cricket ground in Kirtipur in a nail-biting thriller on Monday.Nepal reached the 240-run target set by Namibia with one ball remaining.Khadka was top scorer for Nepal at 103 runs. He scored the runs facing 94 balls hitting seven sixes and five fours. Sharad Veswakar remained not out at 74 runs, while Gyanendra Malla contributed 22 runs for Nepal.Sent to bat first after losing the toss, Namibia scored 239 runs losing nine wickets in the alloted 50 overs. Namibian player S Baard top-scored with 51 runs studded with eight fours off 60 balls. Similarly, Zane Green hit 47 runs including six fours off 87 balls while SF Burger made 43 runs off 60 balls and remained not out.Basanta Regmi, Sandeep Lamichhane and Shakti Gauchan took two wickets each conceding 44, 45 and 39 runs respectively.\r \rIn today’s match, Nepal dropped Raju Rijal and included Sagar Pun in the playing eleven.Nepal had defeated Namibia by five-wicket in the first match on Saturday."
    }
]